<?php

namespace Database\Seeders\Range;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class OperationSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('operations')->insert([
            [
                'code' => '01',
                'name' => 'Операции общего назначения',
                'operation_code' => null
            ],
            [
                'code' => '0101',
                'name' => 'Разметка',
                'operation_code' => '01'
            ],
            [
                'code' => '0102',
                'name' => 'Нарезка',
                'operation_code' => '01'
            ],
            [
                'code' => '0103',
                'name' => 'Нагревание',
                'operation_code' => '01'
            ],
            [
                'code' => '0104',
                'name' => 'Раскрой',
                'operation_code' => '01'
            ],
            [
                'code' => '0105',
                'name' => 'Охлаждение',
                'operation_code' => '01'
            ],
            [
                'code' => '0106',
                'name' => 'Выдержка',
                'operation_code' => '01'
            ],
            [
                'code' => '0107',
                'name' => 'Обдувка',
                'operation_code' => '01'
            ],
            [
                'code' => '0108',
                'name' => 'Слесарная',
                'operation_code' => '01'
            ],
            [
                'code' => '0109',
                'name' => 'Зачистка',
                'operation_code' => '01'
            ],
            [
                'code' => '0113',
                'name' => 'Вакуумирование',
                'operation_code' => '01'
            ],
            [
                'code' => '0114',
                'name' => 'Смазывание',
                'operation_code' => '01'
            ],
            [
                'code' => '0115',
                'name' => 'Пломбирование',
                'operation_code' => '01'
            ],
            [
                'code' => '0116',
                'name' => 'Распломбирование',
                'operation_code' => '01'
            ],
            [
                'code' => '0117',
                'name' => 'Герметизация',
                'operation_code' => '01'
            ],
            [
                'code' => '0118',
                'name' => 'Регенерация',
                'operation_code' => '01'
            ],
            [
                'code' => '0119',
                'name' => 'Ориентация',
                'operation_code' => '01'
            ],
            [
                'code' => '0120',
                'name' => 'Галтовка',
                'operation_code' => '01'
            ],
            [
                'code' => '0121',
                'name' => 'Сбор технологических отходов',
                'operation_code' => '01'
            ],
            [
                'code' => '0122',
                'name' => 'Сдача технологических отходов',
                'operation_code' => '01'
            ],
            [
                'code' => '0123',
                'name' => 'Корректировка составов',
                'operation_code' => '01'
            ],
            [
                'code' => '0124',
                'name' => 'Дефектация',
                'operation_code' => '01'
            ],
            [
                'code' => '0125',
                'name' => 'Промывка',
                'operation_code' => '01'
            ],
            [
                'code' => '0126',
                'name' => 'водой',
                'operation_code' => '0125'
            ],
            [
                'code' => '0127',
                'name' => 'растворителями',
                'operation_code' => '0125'
            ],
            [
                'code' => '0128',
                'name' => 'Термостатирование',
                'operation_code' => '01'
            ],
            [
                'code' => '0129',
                'name' => 'Фильтрование',
                'operation_code' => '01'
            ],
            [
                'code' => '0130',
                'name' => 'Очистка',
                'operation_code' => '01'
            ],
            [
                'code' => '0131',
                'name' => 'пескоструйная',
                'operation_code' => '0130'
            ],
            [
                'code' => '0132',
                'name' => 'гидроструйная',
                'operation_code' => '0130'
            ],
            [
                'code' => '0133',
                'name' => 'струйно-абразивная',
                'operation_code' => '0130'
            ],
            [
                'code' => '0134',
                'name' => 'дробеметная',
                'operation_code' => '0130'
            ],
            [
                'code' => '0135',
                'name' => 'ультразвуковая',
                'operation_code' => '0130'
            ],
            [
                'code' => '0136',
                'name' => 'дробеструйная',
                'operation_code' => '0130'
            ],
            [
                'code' => '0137',
                'name' => 'газопламенная',
                'operation_code' => '0130'
            ],
            [
                'code' => '0138',
                'name' => 'электрохимическая',
                'operation_code' => '0130'
            ],
            [
                'code' => '0139',
                'name' => 'виброабразивная',
                'operation_code' => '0130'
            ],
            [
                'code' => '0143',
                'name' => 'химическая',
                'operation_code' => '0130'
            ],
            [
                'code' => '0144',
                'name' => 'ионная, плазменная',
                'operation_code' => '0130'
            ],
            [
                'code' => '0145',
                'name' => 'Изолирование, защита',
                'operation_code' => '01'
            ],
            [
                'code' => '0146',
                'name' => 'составами органическими',
                'operation_code' => '0145'
            ],
            [
                'code' => '0147',
                'name' => 'составами неорганическими',
                'operation_code' => '0145'
            ],
            [
                'code' => '0148',
                'name' => 'лентами, трубками и др.',
                'operation_code' => '0145'
            ],
            [
                'code' => '0150',
                'name' => 'Травление',
                'operation_code' => '01'
            ],
            [
                'code' => '0151',
                'name' => 'химическое',
                'operation_code' => '0150'
            ],
            [
                'code' => '0152',
                'name' => 'электрохимическое',
                'operation_code' => '0150'
            ],
            [
                'code' => '0153',
                'name' => 'ультразвуковое',
                'operation_code' => '0150'
            ],
            [
                'code' => '0154',
                'name' => 'ионное',
                'operation_code' => '0150'
            ],
            [
                'code' => '0155',
                'name' => 'плазмохимическое',
                'operation_code' => '0150'
            ],
            [
                'code' => '0156',
                'name' => 'Дозирование',
                'operation_code' => '01'
            ],
            [
                'code' => '0157',
                'name' => 'по счету',
                'operation_code' => '0156'
            ],
            [
                'code' => '0158',
                'name' => 'по объему',
                'operation_code' => '0156'
            ],
            [
                'code' => '0159',
                'name' => 'по массе',
                'operation_code' => '0156'
            ],
            [
                'code' => '0160',
                'name' => 'Пропитка',
                'operation_code' => '01'
            ],
            [
                'code' => '0161',
                'name' => 'под давлением',
                'operation_code' => '0160'
            ],
            [
                'code' => '0162',
                'name' => 'в вакууме',
                'operation_code' => '0160'
            ],
            [
                'code' => '0163',
                'name' => 'при атмосферном давлении',
                'operation_code' => '0160'
            ],
            [
                'code' => '0164',
                'name' => 'Заливка, засыпка',
                'operation_code' => '01'
            ],
            [
                'code' => '0165',
                'name' => 'Протирка',
                'operation_code' => '01'
            ],
            [
                'code' => '0166',
                'name' => 'Разгерметизация',
                'operation_code' => '01'
            ],
            [
                'code' => '0167',
                'name' => 'Развакуумирование',
                'operation_code' => '01'
            ],
            [
                'code' => '0168',
                'name' => 'Подготовка (оснастки, оборудования, арматуры, кабеля и т. д.)',
                'operation_code' => '01'
            ],
            [
                'code' => '0169',
                'name' => 'Приготовление (смесей, флюсов, композиций и др.)',
                'operation_code' => '01'
            ],
            [
                'code' => '0170',
                'name' => 'Сушка',
                'operation_code' => '01'
            ],
            [
                'code' => '0171',
                'name' => 'атмосферная',
                'operation_code' => '0170'
            ],
            [
                'code' => '0172',
                'name' => 'конвективная',
                'operation_code' => '0170'
            ],
            [
                'code' => '0173',
                'name' => 'терморадиационная',
                'operation_code' => '0170'
            ],
            [
                'code' => '0174',
                'name' => 'вакуумная',
                'operation_code' => '0170'
            ],
            [
                'code' => '0175',
                'name' => 'в электромагнитном поле',
                'operation_code' => '0170'
            ],
            [
                'code' => '0176',
                'name' => 'фотохимическая',
                'operation_code' => '0170'
            ],
            [
                'code' => '0177',
                'name' => 'световыми лучами',
                'operation_code' => '0170'
            ],
            [
                'code' => '0178',
                'name' => 'ультразвуковым, электронным облучением',
                'operation_code' => '0170'
            ],
            [
                'code' => '0179',
                'name' => 'в активной, в пассивной среде',
                'operation_code' => '0170'
            ],
            [
                'code' => '0180',
                'name' => 'Маркирование',
                'operation_code' => '01'
            ],
            [
                'code' => '0181',
                'name' => 'ударом',
                'operation_code' => '0180'
            ],
            [
                'code' => '0182',
                'name' => 'гравированием',
                'operation_code' => '0180'
            ],
            [
                'code' => '0183',
                'name' => 'травлением',
                'operation_code' => '0180'
            ],
            [
                'code' => '0184',
                'name' => 'лазерное',
                'operation_code' => '0180'
            ],
            [
                'code' => '0185',
                'name' => 'литьем под давлением',
                'operation_code' => '0180'
            ],
            [
                'code' => '0186',
                'name' => 'лентой, краской, трубкой, биркой, этикеткой и др.',
                'operation_code' => '0180'
            ],
            [
                'code' => '0187',
                'name' => 'вжиганием',
                'operation_code' => '0180'
            ],
            [
                'code' => '0188',
                'name' => 'электрохимическое',
                'operation_code' => '0180'
            ],
            [
                'code' => '0189',
                'name' => 'электроэрозионное',
                'operation_code' => '0180'
            ],
            [
                'code' => '0190',
                'name' => 'Обезжиривание, обессмоливание',
                'operation_code' => '01'
            ],
            [
                'code' => '0191',
                'name' => 'Обезжиривание химическое',
                'operation_code' => '0190'
            ],
            [
                'code' => '0192',
                'name' => 'Обезжиривание электрохимическое',
                'operation_code' => '0190'
            ],
            [
                'code' => '0193',
                'name' => 'Обезжиривание ультразвуковое',
                'operation_code' => '0190'
            ],
            [
                'code' => '0194',
                'name' => 'Обезжиривание плазмохимическое',
                'operation_code' => '0190'
            ],
            [
                'code' => '0195',
                'name' => 'Удаление покрытий',
                'operation_code' => '0190'
            ],
            [
                'code' => '0196',
                'name' => 'Удаление изоляции',
                'operation_code' => '0190'
            ],
            [
                'code' => '0197',
                'name' => 'Намагничивание',
                'operation_code' => '01'
            ],
            [
                'code' => '0198',
                'name' => 'Размагничивание',
                'operation_code' => '01'
            ],
            [
                'code' => '02',
                'name' => 'Технический контроль',
                'operation_code' => null
            ],
            [
                'code' => '0200',
                'name' => 'Контроль',
                'operation_code' => '02'
            ],
            [
                'code' => '0210',
                'name' => 'Контроль величин пространства и времени',
                'operation_code' => '02'
            ],
            [
                'code' => '0211',
                'name' => 'Контроль времени',
                'operation_code' => '0210'
            ],
            [
                'code' => '0212',
                'name' => 'Контроль площади',
                'operation_code' => '0210'
            ],
            [
                'code' => '0213',
                'name' => 'Контроль объема',
                'operation_code' => '0210'
            ],
            [
                'code' => '0214',
                'name' => 'Контроль скорости',
                'operation_code' => '0210'
            ],
            [
                'code' => '0215',
                'name' => 'Контроль ускорения',
                'operation_code' => '0210'
            ],
            [
                'code' => '0216',
                'name' => 'Контроль плоского угла',
                'operation_code' => '0210'
            ],
            [
                'code' => '0217',
                'name' => 'Контроль телесного угла',
                'operation_code' => '0210'
            ],
            [
                'code' => '0218',
                'name' => 'Контроль длины',
                'operation_code' => '0210'
            ],
            [
                'code' => '0220',
                'name' => 'Контроль линейных размеров',
                'operation_code' => '0210'
            ],
            [
                'code' => '0221',
                'name' => 'Контроль между плоскими поверхностями',
                'operation_code' => '0220'
            ],
            [
                'code' => '0222',
                'name' => 'Контроль между криволинейными поверхностями',
                'operation_code' => '0220'
            ],
            [
                'code' => '0223',
                'name' => 'Контроль между осями поверхностей',
                'operation_code' => '0220'
            ],
            [
                'code' => '0224',
                'name' => 'Контроль между координатами',
                'operation_code' => '0220'
            ],
            [
                'code' => '0225',
                'name' => 'Контроль размеров криволинейных поверхностей',
                'operation_code' => '0210'
            ],
            [
                'code' => '0226',
                'name' => 'Контроль кривизны',
                'operation_code' => '0225'
            ],
            [
                'code' => '0227',
                'name' => 'Контроль диаметра',
                'operation_code' => '0225'
            ],
            [
                'code' => '0228',
                'name' => 'Контроль радиуса',
                'operation_code' => '0225'
            ],
            [
                'code' => '0230',
                'name' => 'Контроль расположения поверхности',
                'operation_code' => '0210'
            ],
            [
                'code' => '0231',
                'name' => 'Контроль параллельности',
                'operation_code' => '0230'
            ],
            [
                'code' => '0232',
                'name' => 'Контроль перпендикулярности',
                'operation_code' => '0230'
            ],
            [
                'code' => '0233',
                'name' => 'Контроль наклона',
                'operation_code' => '0230'
            ],
            [
                'code' => '0235',
                'name' => 'Контроль соосности (концентричности)',
                'operation_code' => '0230'
            ],
            [
                'code' => '0236',
                'name' => 'Контроль симметричности',
                'operation_code' => '0230'
            ],
            [
                'code' => '0237',
                'name' => 'Контроль пересечения осей',
                'operation_code' => '0230'
            ],
            [
                'code' => '0238',
                'name' => 'Контроль позиционного расположения',
                'operation_code' => '0230'
            ],
            [
                'code' => '0240',
                'name' => 'Контроль формы поверхности',
                'operation_code' => '0210'
            ],
            [
                'code' => '0241',
                'name' => 'Контроль плоскостности',
                'operation_code' => '0240'
            ],
            [
                'code' => '0242',
                'name' => 'Контроль прямолинейности',
                'operation_code' => '0240'
            ],
            [
                'code' => '0245',
                'name' => 'Контроль цилиндричности',
                'operation_code' => '0240'
            ],
            [
                'code' => '0246',
                'name' => 'Контроль круглости',
                'operation_code' => '0240'
            ],
            [
                'code' => '0247',
                'name' => 'Контроль профиля продольного сечения',
                'operation_code' => '0240'
            ],
            [
                'code' => '0250',
                'name' => 'Контроль формы и расположения поверхностей',
                'operation_code' => '0210'
            ],
            [
                'code' => '0251',
                'name' => 'Контроль биения радиального',
                'operation_code' => '0250'
            ],
            [
                'code' => '0252',
                'name' => 'Контроль биения торцевого',
                'operation_code' => '0250'
            ],
            [
                'code' => '0253',
                'name' => 'Контроль биения в заданном направлении',
                'operation_code' => '0250'
            ],
            [
                'code' => '0254',
                'name' => 'Контроль формы заданного профиля',
                'operation_code' => '0250'
            ],
            [
                'code' => '0255',
                'name' => 'Контроль формы заданной поверхности',
                'operation_code' => '0250'
            ],
            [
                'code' => '0260',
                'name' => 'Комплексный контроль геометрических параметров',
                'operation_code' => '0210'
            ],
            [
                'code' => '0261',
                'name' => 'Контроль резьбовых деталей',
                'operation_code' => '0260'
            ],
            [
                'code' => '0262',
                'name' => 'Контроль среднего диаметра',
                'operation_code' => '0261'
            ],
            [
                'code' => '0263',
                'name' => 'Контроль приведенного диаметра',
                'operation_code' => '0261'
            ],
            [
                'code' => '0264',
                'name' => 'Контроль шага резьбы',
                'operation_code' => '0261'
            ],
            [
                'code' => '0265',
                'name' => 'Контроль шлицевых деталей',
                'operation_code' => '0260'
            ],
            [
                'code' => '0266',
                'name' => 'Контроль шероховатости',
                'operation_code' => '0260'
            ],
            [
                'code' => '0270',
                'name' => 'Контроль зубчатых деталей',
                'operation_code' => '0260'
            ],
            [
                'code' => '0271',
                'name' => 'Контроль кинематической погрешности',
                'operation_code' => '0270'
            ],
            [
                'code' => '0272',
                'name' => 'Контроль радиального биения зубчатого венца',
                'operation_code' => '0270'
            ],
            [
                'code' => '0273',
                'name' => 'Контроль накопленной погрешности шага',
                'operation_code' => '0270'
            ],
            [
                'code' => '0274',
                'name' => 'Контроль окружного шага',
                'operation_code' => '0270'
            ],
            [
                'code' => '0275',
                'name' => 'Контроль циклической погрешности',
                'operation_code' => '0270'
            ],
            [
                'code' => '0276',
                'name' => 'Контроль межосевого расстояния на одном зубе',
                'operation_code' => '0270'
            ],
            [
                'code' => '0277',
                'name' => 'Контроль профиля зубьев',
                'operation_code' => '0270'
            ],
            [
                'code' => '0278',
                'name' => 'Контроль колебания длины общей нормали',
                'operation_code' => '0270'
            ],
            [
                'code' => '0281',
                'name' => 'Контроль направления зуба',
                'operation_code' => '0270'
            ],
            [
                'code' => '0282',
                'name' => 'Контроль суммарного пятна контакта',
                'operation_code' => '0270'
            ],
            [
                'code' => '0283',
                'name' => 'Контроль шага зацепления',
                'operation_code' => '0270'
            ],
            [
                'code' => '0284',
                'name' => 'Контроль элементов колеса',
                'operation_code' => '0270'
            ],
            [
                'code' => '0285',
                'name' => 'Контроль толщины зуба',
                'operation_code' => '0270'
            ],
            [
                'code' => '0286',
                'name' => 'Контроль гарантированного бокового зазора',
                'operation_code' => '0270'
            ],
            [
                'code' => '0287',
                'name' => 'Контроль смещения исходного контура',
                'operation_code' => '0270'
            ],
            [
                'code' => '0290',
                'name' => 'Контроль червячных деталей',
                'operation_code' => '0260'
            ],
            [
                'code' => '0291',
                'name' => 'Контроль винтовой линии червяка',
                'operation_code' => '0290'
            ],
            [
                'code' => '0292',
                'name' => 'Контроль осевого шага червяка',
                'operation_code' => '0290'
            ],
            [
                'code' => '0293',
                'name' => 'Контроль кинематической погрешности червяка',
                'operation_code' => '0290'
            ],
            [
                'code' => '0294',
                'name' => 'Контроль биения витков червяка',
                'operation_code' => '0290'
            ],
            [
                'code' => '0295',
                'name' => 'Контроль элементов колеса',
                'operation_code' => '0290'
            ],
            [
                'code' => '0296',
                'name' => 'Контроль пятна контакта',
                'operation_code' => '0290'
            ],
            [
                'code' => '0297',
                'name' => 'Контроль угла и формы червяка',
                'operation_code' => '0290'
            ],
            [
                'code' => '03',
                'name' => 'Технический контроль',
                'operation_code' => null
            ],
            [
                'code' => '0310',
                'name' => 'Контроль механических величин',
                'operation_code' => '03'
            ],
            [
                'code' => '0311',
                'name' => 'Контроль массы',
                'operation_code' => '0310'
            ],
            [
                'code' => '0312',
                'name' => 'Контроль плотности',
                'operation_code' => '0310'
            ],
            [
                'code' => '0314',
                'name' => 'Контроль момента инерции',
                'operation_code' => '0310'
            ],
            [
                'code' => '0315',
                'name' => 'Контроль силы, веса',
                'operation_code' => '0310'
            ],
            [
                'code' => '0316',
                'name' => 'Контроль давления',
                'operation_code' => '0310'
            ],
            [
                'code' => '0317',
                'name' => 'Контроль вязкости динамической',
                'operation_code' => '0310'
            ],
            [
                'code' => '0318',
                'name' => 'Контроль вязкости кинематической',
                'operation_code' => '0310'
            ],
            [
                'code' => '0320',
                'name' => 'Контроль электрических и магнитных величин',
                'operation_code' => '03'
            ],
            [
                'code' => '0321',
                'name' => 'Контроль силы электрического тока',
                'operation_code' => '0320'
            ],
            [
                'code' => '0322',
                'name' => 'Контроль электрического напряжения',
                'operation_code' => '0320'
            ],
            [
                'code' => '0323',
                'name' => 'Контроль электрического сопротивления',
                'operation_code' => '0320'
            ],
            [
                'code' => '0324',
                'name' => 'Контроль электрической емкости',
                'operation_code' => '0320'
            ],
            [
                'code' => '0326',
                'name' => 'Контроль магнитного потока',
                'operation_code' => '0320'
            ],
            [
                'code' => '0327',
                'name' => 'Контроль индуктивности',
                'operation_code' => '0320'
            ],
            [
                'code' => '0328',
                'name' => 'Контроль магнитного сопротивления',
                'operation_code' => '0320'
            ],
            [
                'code' => '0329',
                'name' => 'Контроль динамических электрических величин',
                'operation_code' => '0320'
            ],
            [
                'code' => '0330',
                'name' => 'Контроль тепловых величин',
                'operation_code' => '03'
            ],
            [
                'code' => '0331',
                'name' => 'Контроль температуры',
                'operation_code' => '0330'
            ],
            [
                'code' => '0332',
                'name' => 'Контроль теплоемкости',
                'operation_code' => '0330'
            ],
            [
                'code' => '0333',
                'name' => 'Контроль теплового потока',
                'operation_code' => '0330'
            ],
            [
                'code' => '0334',
                'name' => 'Контроль теплопроводности',
                'operation_code' => '0330'
            ],
            [
                'code' => '0335',
                'name' => 'Контроль акустических величин',
                'operation_code' => '03'
            ],
            [
                'code' => '0336',
                'name' => 'Контроль звукового давления',
                'operation_code' => '0335'
            ],
            [
                'code' => '0337',
                'name' => 'Контроль объемной скорости',
                'operation_code' => '0335'
            ],
            [
                'code' => '0338',
                'name' => 'Контроль интенсивности звука',
                'operation_code' => '0335'
            ],
            [
                'code' => '0340',
                'name' => 'Контроль световых величин и величин электромагнитных излучении',
                'operation_code' => '03'
            ],
            [
                'code' => '0341',
                'name' => 'Контроль силы света',
                'operation_code' => '0340'
            ],
            [
                'code' => '0342',
                'name' => 'Контроль светового потока',
                'operation_code' => '0340'
            ],
            [
                'code' => '0343',
                'name' => 'Контроль освещенности',
                'operation_code' => '0340'
            ],
            [
                'code' => '0344',
                'name' => 'Контроль яркости',
                'operation_code' => '0340'
            ],
            [
                'code' => '0346',
                'name' => 'Контроль энергии излучения',
                'operation_code' => '0340'
            ],
            [
                'code' => '0347',
                'name' => 'Контроль потока излучения',
                'operation_code' => '0340'
            ],
            [
                'code' => '0348',
                'name' => 'Контроль энергетической освещенности',
                'operation_code' => '0340'
            ],
            [
                'code' => '0349',
                'name' => 'Контроль энергетической яркости',
                'operation_code' => '0340'
            ],
            [
                'code' => '0350',
                'name' => 'Контроль величин физической оптики',
                'operation_code' => '03'
            ],
            [
                'code' => '0351',
                'name' => 'Контроль оптических параметров и характеристик',
                'operation_code' => '0350'
            ],
            [
                'code' => '0354',
                'name' => 'Контроль теплового излучения',
                'operation_code' => '0350'
            ],
            [
                'code' => '0355',
                'name' => 'Контроль периодических величин',
                'operation_code' => '03'
            ],
            [
                'code' => '0356',
                'name' => 'Контроль частоты периодического процесса',
                'operation_code' => '0355'
            ],
            [
                'code' => '0357',
                'name' => 'Контроль частоты вращения',
                'operation_code' => '0355'
            ],
            [
                'code' => '0360',
                'name' => 'Контроль величин ионизирующих излучений',
                'operation_code' => '03'
            ],
            [
                'code' => '0361',
                'name' => 'Контроль активности нуклида в радиоактивном источнике',
                'operation_code' => '0360'
            ],
            [
                'code' => '0362',
                'name' => 'Контроль поглощенной дозы излучения',
                'operation_code' => '0360'
            ],
            [
                'code' => '0365',
                'name' => 'Контроль величин физической химии и молекулярной физики',
                'operation_code' => '03'
            ],
            [
                'code' => '0366',
                'name' => 'Контроль молярной массы',
                'operation_code' => '0365'
            ],
            [
                'code' => '0367',
                'name' => 'Контроль молярного объема',
                'operation_code' => '0365'
            ],
            [
                'code' => '0368',
                'name' => 'Контроль химического потенциала',
                'operation_code' => '0365'
            ],
            [
                'code' => '0369',
                'name' => 'Контроль температуропроводности',
                'operation_code' => '0365'
            ],
            [
                'code' => '0371',
                'name' => 'Контроль количества вещества',
                'operation_code' => '0365'
            ],
            [
                'code' => '0372',
                'name' => 'Контроль концентрации',
                'operation_code' => '0365'
            ],
            [
                'code' => '0375',
                'name' => 'Контроль качественных характеристик',
                'operation_code' => '03'
            ],
            [
                'code' => '0376',
                'name' => 'Контроль неразрушающий акустический (ультразвуковой)',
                'operation_code' => '0375'
            ],
            [
                'code' => '0377',
                'name' => 'Контроль неразрушающий вихретоковый',
                'operation_code' => '0375'
            ],
            [
                'code' => '0378',
                'name' => 'Контроль неразрушающий магнитный',
                'operation_code' => '0375'
            ],
            [
                'code' => '0379',
                'name' => 'Контроль неразрушающий оптический',
                'operation_code' => '0375'
            ],
            [
                'code' => '0381',
                'name' => 'Контроль неразрушающий радиационный',
                'operation_code' => '0375'
            ],
            [
                'code' => '0382',
                'name' => 'Контроль неразрушающий радиоволновый',
                'operation_code' => '0375'
            ],
            [
                'code' => '0383',
                'name' => 'Контроль неразрушающий тепловой',
                'operation_code' => '0375'
            ],
            [
                'code' => '0384',
                'name' => 'Контроль неразрушающий электрический',
                'operation_code' => '0375'
            ],
            [
                'code' => '0386',
                'name' => 'Контроль неразрушающий проникающими веществами',
                'operation_code' => '0375'
            ],
            [
                'code' => '0387',
                'name' => 'Контроль внешнего вида изделий, наличия клейм',
                'operation_code' => '0375'
            ],
            [
                'code' => '0390',
                'name' => 'Контроль прочих величин и характеристик',
                'operation_code' => '03'
            ],
            [
                'code' => '0391',
                'name' => 'Контроль технического состояния',
                'operation_code' => '0390'
            ],
            [
                'code' => '0392',
                'name' => 'Контроль функционирования',
                'operation_code' => '0390'
            ],
            [
                'code' => '0393',
                'name' => 'Контроль работоспособности',
                'operation_code' => '0390'
            ],
            [
                'code' => '0394',
                'name' => 'Контроль надежности',
                'operation_code' => '0390'
            ],
            [
                'code' => '0396',
                'name' => 'Контроль количества штук',
                'operation_code' => '0390'
            ],
            [
                'code' => '0397',
                'name' => 'Контроль расхода',
                'operation_code' => '0390'
            ],
            [
                'code' => '04',
                'name' => 'Перемещение',
                'operation_code' => null
            ],
            [
                'code' => '0400',
                'name' => 'Перемещение',
                'operation_code' => '04'
            ],
            [
                'code' => '0401',
                'name' => 'Транспортирование',
                'operation_code' => '04'
            ],
            [
                'code' => '0404',
                'name' => 'Погрузка',
                'operation_code' => '04'
            ],
            [
                'code' => '0405',
                'name' => 'Загрузка',
                'operation_code' => '04'
            ],
            [
                'code' => '0406',
                'name' => 'Разгрузка',
                'operation_code' => '04'
            ],
            [
                'code' => '0407',
                'name' => 'Выгрузка',
                'operation_code' => '04'
            ],
            [
                'code' => '0408',
                'name' => 'Перегрузка',
                'operation_code' => '04'
            ],
            [
                'code' => '0409',
                'name' => 'Перекладка',
                'operation_code' => '04'
            ],
            [
                'code' => '0411',
                'name' => 'Кантование',
                'operation_code' => '04'
            ],
            [
                'code' => '0412',
                'name' => 'Штабелирование',
                'operation_code' => '04'
            ],
            [
                'code' => '0413',
                'name' => 'Дештабелирование',
                'operation_code' => '04'
            ],
            [
                'code' => '0414',
                'name' => 'Стеллажирование',
                'operation_code' => '04'
            ],
            [
                'code' => '0415',
                'name' => 'Дестеллажирование',
                'operation_code' => '04'
            ],
            [
                'code' => '0416',
                'name' => 'Переливание',
                'operation_code' => '04'
            ],
            [
                'code' => '0417',
                'name' => 'Пересыпание',
                'operation_code' => '04'
            ],
            [
                'code' => '0418',
                'name' => 'Комплектование',
                'operation_code' => '04'
            ],
            [
                'code' => '0419',
                'name' => 'Раскладка',
                'operation_code' => '04'
            ],
            [
                'code' => '0421',
                'name' => 'Сортирование',
                'operation_code' => '04'
            ],
            [
                'code' => '0422',
                'name' => 'Пакетирование',
                'operation_code' => '04'
            ],
            [
                'code' => '0423',
                'name' => 'Распакетирование',
                'operation_code' => '04'
            ],
            [
                'code' => '0424',
                'name' => 'Укладывание',
                'operation_code' => '04'
            ],
            [
                'code' => '0425',
                'name' => 'Рыхление',
                'operation_code' => '04'
            ],
            [
                'code' => '0426',
                'name' => 'Разравнивание',
                'operation_code' => '04'
            ],
            [
                'code' => '0427',
                'name' => 'Раскрепление',
                'operation_code' => '04'
            ],
            [
                'code' => '0428',
                'name' => 'Закрепление',
                'operation_code' => '04'
            ],
            [
                'code' => '0429',
                'name' => 'Накопление',
                'operation_code' => '04'
            ],
            [
                'code' => '0430',
                'name' => 'Хранение',
                'operation_code' => '04'
            ],
            [
                'code' => '0431',
                'name' => 'Поворотная',
                'operation_code' => '04'
            ],
            [
                'code' => '0432',
                'name' => 'Укрывание',
                'operation_code' => '04'
            ],
            [
                'code' => '0433',
                'name' => 'Раскрывание',
                'operation_code' => '04'
            ],
            [
                'code' => '0434',
                'name' => 'Раскомплектование',
                'operation_code' => '04'
            ],
            [
                'code' => '0435',
                'name' => 'Перекачивание',
                'operation_code' => '04'
            ],
            [
                'code' => '0436',
                'name' => 'Торцевыравнивание',
                'operation_code' => '04'
            ],
            [
                'code' => '0440',
                'name' => 'Складирование',
                'operation_code' => '04'
            ],
            [
                'code' => '06',
                'name' => 'Испытания',
                'operation_code' => null
            ],
            [
                'code' => '0600',
                'name' => 'Испытания',
                'operation_code' => '06'
            ],
            [
                'code' => '0610',
                'name' => 'Испытания на надежность',
                'operation_code' => '06'
            ],
            [
                'code' => '0611',
                'name' => 'Испытания на безотказность',
                'operation_code' => '0610'
            ],
            [
                'code' => '0612',
                'name' => 'Испытания на сохраняемость',
                'operation_code' => '0610'
            ],
            [
                'code' => '0613',
                'name' => 'Испытания на ремонтопригодность',
                'operation_code' => '0610'
            ],
            [
                'code' => '0614',
                'name' => 'Испытания на долговечность',
                'operation_code' => '0610'
            ],
            [
                'code' => '0615',
                'name' => 'Испытания на функциональность',
                'operation_code' => '06'
            ],
            [
                'code' => '0620',
                'name' => 'Испытания механические',
                'operation_code' => '06'
            ],
            [
                'code' => '0621',
                'name' => 'на воздействие статической нагрузки',
                'operation_code' => '0620'
            ],
            [
                'code' => '0622',
                'name' => 'на растяжение',
                'operation_code' => '0621'
            ],
            [
                'code' => '0623',
                'name' => 'на срез',
                'operation_code' => '0621'
            ],
            [
                'code' => '0624',
                'name' => 'на ползучесть',
                'operation_code' => '0621'
            ],
            [
                'code' => '0625',
                'name' => 'на кручение',
                'operation_code' => '0621'
            ],
            [
                'code' => '0626',
                'name' => 'на изгиб',
                'operation_code' => '0621'
            ],
            [
                'code' => '0627',
                'name' => 'на сжатие',
                'operation_code' => '0621'
            ],
            [
                'code' => '0628',
                'name' => 'на длительную прочность',
                'operation_code' => '0621'
            ],
            [
                'code' => '0629',
                'name' => 'на твердость, микротвердость',
                'operation_code' => '0621'
            ],
            [
                'code' => '0631',
                'name' => 'на релаксацию',
                'operation_code' => '0621'
            ],
            [
                'code' => '0632',
                'name' => 'на прокаливаемость',
                'operation_code' => '0621'
            ],
            [
                'code' => '0633',
                'name' => 'на адгезию',
                'operation_code' => '0621'
            ],
            [
                'code' => '0634',
                'name' => 'на пластичность',
                'operation_code' => '0621'
            ],
            [
                'code' => '0635',
                'name' => 'на воздействие динамической нагрузки',
                'operation_code' => '0620'
            ],
            [
                'code' => '0636',
                'name' => 'на усталость',
                'operation_code' => '0635'
            ],
            [
                'code' => '0637',
                'name' => 'при растяжении-сжатии',
                'operation_code' => '0636'
            ],
            [
                'code' => '0638',
                'name' => 'при изгибе',
                'operation_code' => '0636'
            ],
            [
                'code' => '0639',
                'name' => 'при кручении',
                'operation_code' => '0636'
            ],
            [
                'code' => '0641',
                'name' => 'на ударную вязкость',
                'operation_code' => '0635'
            ],
            [
                'code' => '0642',
                'name' => 'на механическое старение',
                'operation_code' => '0635'
            ],
            [
                'code' => '0643',
                'name' => 'на прочность',
                'operation_code' => '0635'
            ],
            [
                'code' => '0644',
                'name' => 'на адгезию',
                'operation_code' => '0635'
            ],
            [
                'code' => '0645',
                'name' => 'на воздействие трения',
                'operation_code' => '0620'
            ],
            [
                'code' => '0646',
                'name' => 'при вращательном движении',
                'operation_code' => '0645'
            ],
            [
                'code' => '0647',
                'name' => 'при возвратно-поступательном движении',
                'operation_code' => '0645'
            ],
            [
                'code' => '0650',
                'name' => 'на воздействие удара',
                'operation_code' => '0620'
            ],
            [
                'code' => '0651',
                'name' => 'механического',
                'operation_code' => '0650'
            ],
            [
                'code' => '0652',
                'name' => 'однократного действия',
                'operation_code' => '0651'
            ],
            [
                'code' => '0653',
                'name' => 'многократного действия',
                'operation_code' => '0651'
            ],
            [
                'code' => '0654',
                'name' => 'при свободном падении',
                'operation_code' => '0651'
            ],
            [
                'code' => '0655',
                'name' => 'гидравлического',
                'operation_code' => '0650'
            ],
            [
                'code' => '0656',
                'name' => 'аэродинамического',
                'operation_code' => '0650'
            ],
            [
                'code' => '0657',
                'name' => 'сейсмического',
                'operation_code' => '0650'
            ],
            [
                'code' => '0658',
                'name' => 'баллистического',
                'operation_code' => '0650'
            ],
            [
                'code' => '0659',
                'name' => 'ударной (взрывной) волны',
                'operation_code' => '0650'
            ],
            [
                'code' => '0660',
                'name' => 'на воздействие ускорения',
                'operation_code' => '0620'
            ],
            [
                'code' => '0661',
                'name' => 'линейного',
                'operation_code' => '0660'
            ],
            [
                'code' => '0662',
                'name' => 'углового (центробежного)',
                'operation_code' => '0660'
            ],
            [
                'code' => '0663',
                'name' => 'центростремительного',
                'operation_code' => '0660'
            ],
            [
                'code' => '0664',
                'name' => 'невесомости',
                'operation_code' => '0660'
            ],
            [
                'code' => '0665',
                'name' => 'на воздействие колебаний',
                'operation_code' => '0620'
            ],
            [
                'code' => '0666',
                'name' => 'качки',
                'operation_code' => '0665'
            ],
            [
                'code' => '0667',
                'name' => 'наклона (крена)',
                'operation_code' => '0665'
            ],
            [
                'code' => '0668',
                'name' => 'акустического шума',
                'operation_code' => '0665'
            ],
            [
                'code' => '0669',
                'name' => 'вибрации',
                'operation_code' => '0665'
            ],
            [
                'code' => '0670',
                'name' => 'на воздействие давления',
                'operation_code' => '0620'
            ],
            [
                'code' => '0671',
                'name' => 'гидравлического повышенного',
                'operation_code' => '0670'
            ],
            [
                'code' => '0672',
                'name' => 'гидравлического пониженного',
                'operation_code' => '0670'
            ],
            [
                'code' => '0673',
                'name' => 'пневматического повышенного',
                'operation_code' => '0670'
            ],
            [
                'code' => '0674',
                'name' => 'пневматического пониженного',
                'operation_code' => '0670'
            ],
            [
                'code' => '0675',
                'name' => 'Испытания на герметичность',
                'operation_code' => '06'
            ],
            [
                'code' => '0676',
                'name' => 'пневматические',
                'operation_code' => '0675'
            ],
            [
                'code' => '0677',
                'name' => 'гидравлические',
                'operation_code' => '0675'
            ],
            [
                'code' => '0678',
                'name' => 'Испытания на отрыв',
                'operation_code' => '06'
            ],
            [
                'code' => '0679',
                'name' => 'Испытания на безопасность',
                'operation_code' => '06'
            ],
            [
                'code' => '07',
                'name' => 'Испытания',
                'operation_code' => null
            ],
            [
                'code' => '0710',
                'name' => 'Испытания климатические',
                'operation_code' => '07'
            ],
            [
                'code' => '0712',
                'name' => 'на воздействие температуры среды повышенной',
                'operation_code' => '0710'
            ],
            [
                'code' => '0713',
                'name' => 'на воздействие температуры среды пониженной',
                'operation_code' => '0710'
            ],
            [
                'code' => '0714',
                'name' => 'на воздействие смены температур (термоциклирования)',
                'operation_code' => '0710'
            ],
            [
                'code' => '0716',
                'name' => 'на воздействие атмосферного давления повышенного',
                'operation_code' => '0710'
            ],
            [
                'code' => '0717',
                'name' => 'на воздействие атмосферного давления пониженного',
                'operation_code' => '0710'
            ],
            [
                'code' => '0719',
                'name' => 'на воздействие атмосферных осадков выпадающих',
                'operation_code' => '0710'
            ],
            [
                'code' => '0721',
                'name' => 'на воздействие атмосферных осадков конденсированных',
                'operation_code' => '0710'
            ],
            [
                'code' => '0722',
                'name' => 'на воздействие влажности (брызг)',
                'operation_code' => '0710'
            ],
            [
                'code' => '0723',
                'name' => 'на воздействие солнечного излучения',
                'operation_code' => '0710'
            ],
            [
                'code' => '0724',
                'name' => 'на воздействие тумана',
                'operation_code' => '0710'
            ],
            [
                'code' => '0725',
                'name' => 'на воздействие ледово-грунтовой среды',
                'operation_code' => '0710'
            ],
            [
                'code' => '0726',
                'name' => 'на воздействие пыли, песка',
                'operation_code' => '0710'
            ],
            [
                'code' => '0729',
                'name' => 'на воздействие потока воздуха скоростного дозвукового',
                'operation_code' => '0710'
            ],
            [
                'code' => '0731',
                'name' => 'на воздействие потока воздуха скоростного сверхзвукового',
                'operation_code' => '0710'
            ],
            [
                'code' => '0732',
                'name' => 'на воздействие ветра',
                'operation_code' => '0710'
            ],
            [
                'code' => '0735',
                'name' => 'Испытания термические',
                'operation_code' => '07'
            ],
            [
                'code' => '0736',
                'name' => 'на воздействие теплового удара',
                'operation_code' => '0735'
            ],
            [
                'code' => '0737',
                'name' => 'светового излучения взрыва',
                'operation_code' => '0736'
            ],
            [
                'code' => '0738',
                'name' => 'термического',
                'operation_code' => '0736'
            ],
            [
                'code' => '0739',
                'name' => 'на воздействие нагрева',
                'operation_code' => '0735'
            ],
            [
                'code' => '0741',
                'name' => 'аэродинамического',
                'operation_code' => '0739'
            ],
            [
                'code' => '0742',
                'name' => 'трением',
                'operation_code' => '0739'
            ],
            [
                'code' => '0743',
                'name' => 'тепловым потоком',
                'operation_code' => '0739'
            ],
            [
                'code' => '0744',
                'name' => 'пламенем',
                'operation_code' => '0739'
            ],
            [
                'code' => '0750',
                'name' => 'Испытания химические',
                'operation_code' => '07'
            ],
            [
                'code' => '0751',
                'name' => 'на воздействие кислот',
                'operation_code' => '0750'
            ],
            [
                'code' => '0752',
                'name' => 'на воздействие щелочей',
                'operation_code' => '0750'
            ],
            [
                'code' => '0753',
                'name' => 'на воздействие масел, смазок, красок',
                'operation_code' => '0750'
            ],
            [
                'code' => '0754',
                'name' => 'на воздействие специальных сред',
                'operation_code' => '0750'
            ],
            [
                'code' => '0755',
                'name' => 'на воздействие топлива',
                'operation_code' => '0750'
            ],
            [
                'code' => '0757',
                'name' => 'на воздействие среды с коррозионно-активными агентами атмосферы',
                'operation_code' => '0750'
            ],
            [
                'code' => '0758',
                'name' => 'на воздействие среды с коррозионно-активными агентами водой',
                'operation_code' => '0750'
            ],
            [
                'code' => '0759',
                'name' => 'на воздействие среды с коррозионно-активными агентами почвенно-грунтовой',
                'operation_code' => '0750'
            ],
            [
                'code' => '0760',
                'name' => 'Испытания биологические',
                'operation_code' => '07'
            ],
            [
                'code' => '0761',
                'name' => 'на воздействие позвоночных животных',
                'operation_code' => '0760'
            ],
            [
                'code' => '0762',
                'name' => 'на воздействие беспозвоночных животных',
                'operation_code' => '0760'
            ],
            [
                'code' => '0763',
                'name' => 'на воздействие растений',
                'operation_code' => '0760'
            ],
            [
                'code' => '0765',
                'name' => 'Испытания электрические',
                'operation_code' => '07'
            ],
            [
                'code' => '0766',
                'name' => 'на воздействие постоянного тока (напряжения)',
                'operation_code' => '0765'
            ],
            [
                'code' => '0767',
                'name' => 'на воздействие переменного тока (напряжения) однофазного',
                'operation_code' => '0765'
            ],
            [
                'code' => '0768',
                'name' => 'на воздействие переменного тока (напряжения) многофазного',
                'operation_code' => '0765'
            ],
            [
                'code' => '0769',
                'name' => 'на воздействие электрического импульса тока (напряжения)',
                'operation_code' => '0765'
            ],
            [
                'code' => '0770',
                'name' => 'Испытания электротермические',
                'operation_code' => '07'
            ],
            [
                'code' => '0771',
                'name' => 'на воздействие постоянного тока (напряжения) при температуре выше °С',
                'operation_code' => '0770'
            ],
            [
                'code' => '0772',
                'name' => 'на воздействие постоянного тока (напряжения) при температуре ниже °С',
                'operation_code' => '0770'
            ],
            [
                'code' => '0773',
                'name' => 'на воздействие переменного тока однофазного при температуре выше °С',
                'operation_code' => '0770'
            ],
            [
                'code' => '0774',
                'name' => 'на воздействие переменного тока однофазного при температуре ниже °С',
                'operation_code' => '0770'
            ],
            [
                'code' => '0775',
                'name' => 'на воздействие переменного тока многофазного при температуре выше °С',
                'operation_code' => '0770'
            ],
            [
                'code' => '0776',
                'name' => 'на воздействие переменного тока многофазного при температуре ниже °С',
                'operation_code' => '0770'
            ],
            [
                'code' => '0777',
                'name' => 'на воздействие электрического импульса тока (напряжения) при температуре выше °С',
                'operation_code' => '0770'
            ],
            [
                'code' => '0778',
                'name' => 'на воздействие электрического импульса тока (напряжения) при температуре ниже °С',
                'operation_code' => '0770'
            ],
            [
                'code' => '0780',
                'name' => 'Испытания радиационные',
                'operation_code' => '07'
            ],
            [
                'code' => '0782',
                'name' => 'на воздействие ионизирующего альфа- и бета-излучения',
                'operation_code' => '0780'
            ],
            [
                'code' => '0783',
                'name' => 'на воздействие ионизирующего гамма-излучения',
                'operation_code' => '0780'
            ],
            [
                'code' => '0784',
                'name' => 'на воздействие ионизирующего рентгеновского излучения',
                'operation_code' => '0780'
            ],
            [
                'code' => '0785',
                'name' => 'на воздействие ионизирующего нейтронного, электронного и протонного излучений',
                'operation_code' => '0780'
            ],
            [
                'code' => '0786',
                'name' => 'на воздействие ионизирующего излучения многозарядных частиц',
                'operation_code' => '0780'
            ],
            [
                'code' => '0790',
                'name' => 'Испытания магнитные и электромагнитные',
                'operation_code' => '07'
            ],
            [
                'code' => '0791',
                'name' => 'на воздействие импульсного электрополя',
                'operation_code' => '0790'
            ],
            [
                'code' => '0793',
                'name' => 'на воздействие магнитного поля низкочастотного',
                'operation_code' => '0790'
            ],
            [
                'code' => '0794',
                'name' => 'на воздействие магнитного поля высокочастотного',
                'operation_code' => '0790'
            ],
            [
                'code' => '0795',
                'name' => 'на воздействие магнитного поля сверхвысокочастотного',
                'operation_code' => '0790'
            ],
            [
                'code' => '0796',
                'name' => 'на воздействие лазерного излучения',
                'operation_code' => '0790'
            ],
            [
                'code' => '0797',
                'name' => 'на воздействие электромагнитного импульса взрыва',
                'operation_code' => '0790'
            ],
            [
                'code' => '08',
                'name' => 'Консервация и упаковывание',
                'operation_code' => null
            ],
            [
                'code' => '0800',
                'name' => 'Консервация и упаковывание',
                'operation_code' => '08'
            ],
            [
                'code' => '0801',
                'name' => 'Консервация',
                'operation_code' => '0800'
            ],
            [
                'code' => '0802',
                'name' => 'окунанием',
                'operation_code' => '0801'
            ],
            [
                'code' => '0803',
                'name' => 'обливом',
                'operation_code' => '0801'
            ],
            [
                'code' => '0804',
                'name' => 'смазыванием',
                'operation_code' => '0801'
            ],
            [
                'code' => '0805',
                'name' => 'прокачиванием',
                'operation_code' => '0801'
            ],
            [
                'code' => '0806',
                'name' => 'продуванием',
                'operation_code' => '0801'
            ],
            [
                'code' => '0809',
                'name' => 'распылением',
                'operation_code' => '0801'
            ],
            [
                'code' => '0811',
                'name' => 'завертыванием',
                'operation_code' => '0801'
            ],
            [
                'code' => '0812',
                'name' => 'заливкой',
                'operation_code' => '0801'
            ],
            [
                'code' => '0813',
                'name' => 'летучими ингибиторами на носителях',
                'operation_code' => '0801'
            ],
            [
                'code' => '0814',
                'name' => 'в процессе испытаний',
                'operation_code' => '0801'
            ],
            [
                'code' => '0815',
                'name' => 'герметизацией',
                'operation_code' => '0801'
            ],
            [
                'code' => '0816',
                'name' => 'осушением статическим',
                'operation_code' => '0815'
            ],
            [
                'code' => '0817',
                'name' => 'осушением динамическим',
                'operation_code' => '0815'
            ],
            [
                'code' => '0818',
                'name' => 'ингибированным воздухом',
                'operation_code' => '0815'
            ],
            [
                'code' => '0819',
                'name' => 'инертными газами',
                'operation_code' => '0815'
            ],
            [
                'code' => '0821',
                'name' => 'летучими ингибиторами',
                'operation_code' => '0815'
            ],
            [
                'code' => '0822',
                'name' => 'внутренним упаковыванием',
                'operation_code' => '0801'
            ],
            [
                'code' => '0830',
                'name' => 'Упаковывание',
                'operation_code' => '08'
            ],
            [
                'code' => '0831',
                'name' => 'в бумагу',
                'operation_code' => '0830'
            ],
            [
                'code' => '0832',
                'name' => 'в полимерную пленку',
                'operation_code' => '0830'
            ],
            [
                'code' => '0834',
                'name' => 'герметизированным покрытием',
                'operation_code' => '0830'
            ],
            [
                'code' => '0836',
                'name' => 'в потребительскую тару',
                'operation_code' => '0830'
            ],
            [
                'code' => '0837',
                'name' => 'в ящик, коробку',
                'operation_code' => '0830'
            ],
            [
                'code' => '0838',
                'name' => 'в контейнер',
                'operation_code' => '0830'
            ],
            [
                'code' => '0839',
                'name' => 'в мешок',
                'operation_code' => '0830'
            ],
            [
                'code' => '0841',
                'name' => 'в связку',
                'operation_code' => '0830'
            ],
            [
                'code' => '0842',
                'name' => 'в обрешетку',
                'operation_code' => '0830'
            ],
            [
                'code' => '0843',
                'name' => 'на поддон',
                'operation_code' => '0830'
            ],
            [
                'code' => '0844',
                'name' => 'Обандероливание',
                'operation_code' => '08'
            ],
            [
                'code' => '0846',
                'name' => 'Обвязываем тары (упаковочной единицы)',
                'operation_code' => '08'
            ],
            [
                'code' => '0850',
                'name' => 'Распаковывание',
                'operation_code' => '08'
            ],
            [
                'code' => '0851',
                'name' => 'вскрытием',
                'operation_code' => '0850'
            ],
            [
                'code' => '0852',
                'name' => 'разборкой',
                'operation_code' => '0850'
            ],
            [
                'code' => '0853',
                'name' => 'развязыванием',
                'operation_code' => '0850'
            ],
            [
                'code' => '0854',
                'name' => 'развертыванием',
                'operation_code' => '0850'
            ],
            [
                'code' => '0856',
                'name' => 'потребительской тары',
                'operation_code' => '0850'
            ],
            [
                'code' => '0860',
                'name' => 'Расконсервация',
                'operation_code' => '08'
            ],
            [
                'code' => '0865',
                'name' => 'удалением консервационного материала',
                'operation_code' => '0860'
            ],
            [
                'code' => '0866',
                'name' => 'протиранием',
                'operation_code' => '0865'
            ],
            [
                'code' => '0867',
                'name' => 'окунанием',
                'operation_code' => '0865'
            ],
            [
                'code' => '0868',
                'name' => 'оплавлением',
                'operation_code' => '0865'
            ],
            [
                'code' => '0869',
                'name' => 'разгерметизацией',
                'operation_code' => '0865'
            ],
            [
                'code' => '0871',
                'name' => 'продуванием',
                'operation_code' => '0865'
            ],
            [
                'code' => '0872',
                'name' => 'смыванием',
                'operation_code' => '0865'
            ],
            [
                'code' => '0873',
                'name' => 'срезанием',
                'operation_code' => '0865'
            ],
            [
                'code' => '0874',
                'name' => 'сливом',
                'operation_code' => '0865'
            ],
            [
                'code' => '0876',
                'name' => 'летучих ингибиторов на носителях',
                'operation_code' => '0865'
            ],
            [
                'code' => '10',
                'name' => 'Литье металлов и сплавов',
                'operation_code' => null
            ],
            [
                'code' => '1000',
                'name' => 'Литье металлов и сплавов',
                'operation_code' => '10'
            ],
            [
                'code' => '1010',
                'name' => 'Изготовление литейных моделей',
                'operation_code' => '10'
            ],
            [
                'code' => '1011',
                'name' => 'неметаллических многократных',
                'operation_code' => '1010'
            ],
            [
                'code' => '1012',
                'name' => 'неметаллических разовых растворяемых',
                'operation_code' => '1010'
            ],
            [
                'code' => '1013',
                'name' => 'неметаллических разовых выплавляемых',
                'operation_code' => '1010'
            ],
            [
                'code' => '1014',
                'name' => 'неметаллических разовых выжигаемых',
                'operation_code' => '1010'
            ],
            [
                'code' => '1016',
                'name' => 'металлических многократных',
                'operation_code' => '1010'
            ],
            [
                'code' => '1020',
                'name' => 'Изготовление песчаных литейных форм',
                'operation_code' => '10'
            ],
            [
                'code' => '1021',
                'name' => 'ручным уплотнением формовочной смеси с помощью модели «по-сырому»',
                'operation_code' => '1020'
            ],
            [
                'code' => '1022',
                'name' => 'ручным уплотнением формовочной смеси с помощью модели «по-сухому»',
                'operation_code' => '1020'
            ],
            [
                'code' => '1023',
                'name' => 'ручным уплотнением формовочной смеси с помощью модели химическим отверждением',
                'operation_code' => '1020'
            ],
            [
                'code' => '1024',
                'name' => 'ручным уплотнением формовочной смеси по шаблону «по-сырому»',
                'operation_code' => '1020'
            ],
            [
                'code' => '1025',
                'name' => 'ручным уплотнением формовочной смеси по шаблону «по-сухому»',
                'operation_code' => '1020'
            ],
            [
                'code' => '1026',
                'name' => 'ручным уплотнением формовочной смеси по шаблону химическим отверждением',
                'operation_code' => '1020'
            ],
            [
                'code' => '1027',
                'name' => 'машинным уплотнением формовочной смеси с помощью модели «по-сырому»',
                'operation_code' => '1020'
            ],
            [
                'code' => '1028',
                'name' => 'машинным уплотнением формовочной смеси с помощью модели «по-сухому»',
                'operation_code' => '1020'
            ],
            [
                'code' => '1029',
                'name' => 'машинным уплотнением формовочной смеси с помощью модели химическим отверждением',
                'operation_code' => '1020'
            ],
            [
                'code' => '1040',
                'name' => 'Изготовление песчаных стержней',
                'operation_code' => '10'
            ],
            [
                'code' => '1043',
                'name' => 'ручным уплотнением стержневой смеси с последующей сушкой по стержневому ящику сушкой',
                'operation_code' => '1040'
            ],
            [
                'code' => '1044',
                'name' => 'ручным уплотнением стержневой смеси с последующей сушкой по стержневому ящику химическим отверждением',
                'operation_code' => '1040'
            ],
            [
                'code' => '1045',
                'name' => 'ручным уплотнением стержневой смеси с последующей сушкой по шаблону химическим отверждением',
                'operation_code' => '1040'
            ],
            [
                'code' => '1046',
                'name' => 'ручным уплотнением стержневой смеси с последующей сушкой по шаблону сушкой',
                'operation_code' => '1040'
            ],
            [
                'code' => '1047',
                'name' => 'машинным уплотнением стержневой смеси по стержневому ящику по горячей модельной оснастке',
                'operation_code' => '1040'
            ],
            [
                'code' => '1048',
                'name' => 'машинным уплотнением стержневой смеси по стержневому ящику сушкой',
                'operation_code' => '1040'
            ],
            [
                'code' => '1049',
                'name' => 'машинным уплотнением стержневой смеси по стержневому ящику химическим отверждением',
                'operation_code' => '1040'
            ],
            [
                'code' => '1051',
                'name' => 'Завалка шихтовых материалов в плавильный агрегат',
                'operation_code' => '10'
            ],
            [
                'code' => '1053',
                'name' => 'Плавка металлов и сплавов',
                'operation_code' => '10'
            ],
            [
                'code' => '1060',
                'name' => 'Заливка формы',
                'operation_code' => '10'
            ],
            [
                'code' => '1061',
                'name' => 'свободная в оболочковые формы с применением песчаной смесей без вращательного движения',
                'operation_code' => '1060'
            ],
            [
                'code' => '1062',
                'name' => 'свободная в оболочковые формы с применением песчаной смесей с вращательным движением',
                'operation_code' => '1060'
            ],
            [
                'code' => '1063',
                'name' => 'свободная в керамические формы без вращательного движения',
                'operation_code' => '1060'
            ],
            [
                'code' => '1064',
                'name' => 'свободная в керамические формы с вращательным движением',
                'operation_code' => '1060'
            ],
            [
                'code' => '1065',
                'name' => 'свободная в песчаные формы',
                'operation_code' => '1060'
            ],
            [
                'code' => '1066',
                'name' => 'свободная в кокиль',
                'operation_code' => '1060'
            ],
            [
                'code' => '1067',
                'name' => 'свободная по выплавляемым моделям',
                'operation_code' => '1060'
            ],
            [
                'code' => '1068',
                'name' => 'принудительная под давлением',
                'operation_code' => '1060'
            ],
            [
                'code' => '1069',
                'name' => 'принудительная с противодавлением',
                'operation_code' => '1060'
            ],
            [
                'code' => '1071',
                'name' => 'принудительная под низким давлением',
                'operation_code' => '1060'
            ],
            [
                'code' => '1072',
                'name' => 'принудительная вакуумным всасыванием',
                'operation_code' => '1060'
            ],
            [
                'code' => '1073',
                'name' => 'комбинированная жидкой штамповкой',
                'operation_code' => '1060'
            ],
            [
                'code' => '1074',
                'name' => 'комбинированная вылавливанием',
                'operation_code' => '1060'
            ],
            [
                'code' => '1075',
                'name' => 'Удаление стержней, формовочных смесей',
                'operation_code' => '10'
            ],
            [
                'code' => '1076',
                'name' => 'Выбивка отливок, форм',
                'operation_code' => '10'
            ],
            [
                'code' => '1077',
                'name' => 'Обрубка отливки',
                'operation_code' => '10'
            ],
            [
                'code' => '1087',
                'name' => 'Модифицирование',
                'operation_code' => '10'
            ],
            [
                'code' => '1088',
                'name' => 'Рафинирование',
                'operation_code' => '10'
            ],
            [
                'code' => '1089',
                'name' => 'Футеровка',
                'operation_code' => '10'
            ],
            [
                'code' => '1090',
                'name' => 'Исправление дефектов литья',
                'operation_code' => '10'
            ],
            [
                'code' => '21',
                'name' => 'Обработка давлением',
                'operation_code' => null
            ],
            [
                'code' => '2100',
                'name' => 'Обработка давлением',
                'operation_code' => '21'
            ],
            [
                'code' => '2101',
                'name' => 'Отрезка',
                'operation_code' => '21'
            ],
            [
                'code' => '2102',
                'name' => 'Разрезка',
                'operation_code' => '21'
            ],
            [
                'code' => '2103',
                'name' => 'Обрезка',
                'operation_code' => '21'
            ],
            [
                'code' => '2104',
                'name' => 'Надрезка',
                'operation_code' => '21'
            ],
            [
                'code' => '2105',
                'name' => 'Пробивка',
                'operation_code' => '21'
            ],
            [
                'code' => '2106',
                'name' => 'Проколка',
                'operation_code' => '21'
            ],
            [
                'code' => '2107',
                'name' => 'Отрубка',
                'operation_code' => '21'
            ],
            [
                'code' => '2108',
                'name' => 'Разрубка',
                'operation_code' => '21'
            ],
            [
                'code' => '2109',
                'name' => 'Вырубка',
                'operation_code' => '21'
            ],
            [
                'code' => '2111',
                'name' => 'Надрубка',
                'operation_code' => '21'
            ],
            [
                'code' => '2112',
                'name' => 'Ломка',
                'operation_code' => '21'
            ],
            [
                'code' => '2114',
                'name' => 'Высечка',
                'operation_code' => '21'
            ],
            [
                'code' => '2115',
                'name' => 'Просечка',
                'operation_code' => '21'
            ],
            [
                'code' => '2121',
                'name' => 'Осадка',
                'operation_code' => '21'
            ],
            [
                'code' => '2122',
                'name' => 'Высадка',
                'operation_code' => '21'
            ],
            [
                'code' => '2123',
                'name' => 'Протяжка',
                'operation_code' => '21'
            ],
            [
                'code' => '2124',
                'name' => 'Разгонка',
                'operation_code' => '21'
            ],
            [
                'code' => '2125',
                'name' => 'Радиальное обжатие',
                'operation_code' => '21'
            ],
            [
                'code' => '2126',
                'name' => 'Передача',
                'operation_code' => '21'
            ],
            [
                'code' => '2127',
                'name' => 'Прошивка',
                'operation_code' => '21'
            ],
            [
                'code' => '2128',
                'name' => 'Раскатка',
                'operation_code' => '21'
            ],
            [
                'code' => '2129',
                'name' => 'Гибка',
                'operation_code' => '21'
            ],
            [
                'code' => '2131',
                'name' => 'Скручивание',
                'operation_code' => '21'
            ],
            [
                'code' => '2132',
                'name' => 'Закатка',
                'operation_code' => '21'
            ],
            [
                'code' => '2133',
                'name' => 'Завивка',
                'operation_code' => '21'
            ],
            [
                'code' => '2134',
                'name' => 'Навивка',
                'operation_code' => '21'
            ],
            [
                'code' => '2135',
                'name' => 'Вытяжка',
                'operation_code' => '21'
            ],
            [
                'code' => '2136',
                'name' => 'с утонением',
                'operation_code' => '2135'
            ],
            [
                'code' => '2137',
                'name' => 'ротационная',
                'operation_code' => '2135'
            ],
            [
                'code' => '2138',
                'name' => 'Отбортовка',
                'operation_code' => '21'
            ],
            [
                'code' => '2139',
                'name' => 'Раздача',
                'operation_code' => '21'
            ],
            [
                'code' => '2141',
                'name' => 'Обжим',
                'operation_code' => '21'
            ],
            [
                'code' => '2142',
                'name' => 'Рельефная формовка',
                'operation_code' => '21'
            ],
            [
                'code' => '2143',
                'name' => 'Чеканка',
                'operation_code' => '21'
            ],
            [
                'code' => '2144',
                'name' => 'Кернение',
                'operation_code' => '21'
            ],
            [
                'code' => '2145',
                'name' => 'Выдавливание',
                'operation_code' => '21'
            ],
            [
                'code' => '2147',
                'name' => 'Приглаживание',
                'operation_code' => '21'
            ],
            [
                'code' => '2148',
                'name' => 'Обкатка',
                'operation_code' => '21'
            ],
            [
                'code' => '2149',
                'name' => 'Калибровка',
                'operation_code' => '21'
            ],
            [
                'code' => '2152',
                'name' => 'Волочение',
                'operation_code' => '21'
            ],
            [
                'code' => '2153',
                'name' => 'Накатка',
                'operation_code' => '21'
            ],
            [
                'code' => '2154',
                'name' => 'Профилирование',
                'operation_code' => '21'
            ],
            [
                'code' => '2155',
                'name' => 'Редуцирование',
                'operation_code' => '21'
            ],
            [
                'code' => '2156',
                'name' => 'Правка',
                'operation_code' => '21'
            ],
            [
                'code' => '2157',
                'name' => 'Обтяжка',
                'operation_code' => '21'
            ],
            [
                'code' => '2158',
                'name' => 'Поверхностное пластическое деформирование',
                'operation_code' => '21'
            ],
            [
                'code' => '2159',
                'name' => 'Подкатка',
                'operation_code' => '21'
            ],
            [
                'code' => '2160',
                'name' => 'Ковка',
                'operation_code' => '21'
            ],
            [
                'code' => '2170',
                'name' => 'Штамповка',
                'operation_code' => '21'
            ],
            [
                'code' => '2171',
                'name' => 'объемная',
                'operation_code' => '2170'
            ],
            [
                'code' => '2172',
                'name' => 'вальцовкой',
                'operation_code' => '2170'
            ],
            [
                'code' => '2173',
                'name' => 'листовая',
                'operation_code' => '2170'
            ],
            [
                'code' => '2175',
                'name' => 'импульсная',
                'operation_code' => '2170'
            ],
            [
                'code' => '2176',
                'name' => 'взрывная',
                'operation_code' => '2175'
            ],
            [
                'code' => '2177',
                'name' => 'электрогидравлическая',
                'operation_code' => '2175'
            ],
            [
                'code' => '2178',
                'name' => 'электромагнитная',
                'operation_code' => '2175'
            ],
            [
                'code' => '2180',
                'name' => 'эластичными средствами',
                'operation_code' => '2170'
            ],
            [
                'code' => '2181',
                'name' => 'жидкостью',
                'operation_code' => '2180'
            ],
            [
                'code' => '2182',
                'name' => 'резиной',
                'operation_code' => '2180'
            ],
            [
                'code' => '2183',
                'name' => 'полиуретаном',
                'operation_code' => '2180'
            ],
            [
                'code' => '41',
                'name' => 'Обработка резанием',
                'operation_code' => null
            ],
            [
                'code' => '4100',
                'name' => 'Обработка резанием',
                'operation_code' => '41'
            ],
            [
                'code' => '4101',
                'name' => 'Агрегатная',
                'operation_code' => '41'
            ],
            [
                'code' => '4102',
                'name' => 'Автоматно-линейная',
                'operation_code' => '41'
            ],
            [
                'code' => '4105',
                'name' => 'Резьбонарезная',
                'operation_code' => '41'
            ],
            [
                'code' => '4107',
                'name' => 'Гайконарезная',
                'operation_code' => '4105'
            ],
            [
                'code' => '4108',
                'name' => 'Болтонарезная',
                'operation_code' => '4105'
            ],
            [
                'code' => '4110',
                'name' => 'Токарная',
                'operation_code' => '41'
            ],
            [
                'code' => '4111',
                'name' => 'Токарно-револьверная',
                'operation_code' => '4110'
            ],
            [
                'code' => '4112',
                'name' => 'Автоматно токарная',
                'operation_code' => '4110'
            ],
            [
                'code' => '4113',
                'name' => 'Токарно-карусельная',
                'operation_code' => '4110'
            ],
            [
                'code' => '4114',
                'name' => 'Токарно-винторезная',
                'operation_code' => '4110'
            ],
            [
                'code' => '4115',
                'name' => 'Лоботокарная',
                'operation_code' => '4110'
            ],
            [
                'code' => '4116',
                'name' => 'Токарно-затыловочная',
                'operation_code' => '4110'
            ],
            [
                'code' => '4117',
                'name' => 'Токарно-копировальная',
                'operation_code' => '4110'
            ],
            [
                'code' => '4118',
                'name' => 'Специальная токарная',
                'operation_code' => '4110'
            ],
            [
                'code' => '4119',
                'name' => 'Торцеподрезная-центровальная',
                'operation_code' => '4110'
            ],
            [
                'code' => '4121',
                'name' => 'Вальцетокарная',
                'operation_code' => '4110'
            ],
            [
                'code' => '4122',
                'name' => 'Резьботокарная',
                'operation_code' => '4110'
            ],
            [
                'code' => '4123',
                'name' => 'Токарнобесцентровальная',
                'operation_code' => '4110'
            ],
            [
                'code' => '4130',
                'name' => 'Шлифовальная',
                'operation_code' => '41'
            ],
            [
                'code' => '4131',
                'name' => 'Круглошлифовальная',
                'operation_code' => '4130'
            ],
            [
                'code' => '4132',
                'name' => 'Внутpишлифовальная',
                'operation_code' => '4130'
            ],
            [
                'code' => '4133',
                'name' => 'Плоскошлифовальная',
                'operation_code' => '4130'
            ],
            [
                'code' => '4134',
                'name' => 'Бесцентрово-шлифовальная',
                'operation_code' => '4130'
            ],
            [
                'code' => '4135',
                'name' => 'Реьбошлифовальная',
                'operation_code' => '4130'
            ],
            [
                'code' => '4136',
                'name' => 'Координатно-шлифовальная',
                'operation_code' => '4130'
            ],
            [
                'code' => '4137',
                'name' => 'Обдирочно-шлифовальная',
                'operation_code' => '4130'
            ],
            [
                'code' => '4138',
                'name' => 'Ленточно-шлифовальная',
                'operation_code' => '4130'
            ],
            [
                'code' => '4139',
                'name' => 'Шлифовально-затыловочная',
                'operation_code' => '4130'
            ],
            [
                'code' => '4141',
                'name' => 'Шлицешлифовальная',
                'operation_code' => '4130'
            ],
            [
                'code' => '4142',
                'name' => 'Заточная',
                'operation_code' => '4130'
            ],
            [
                'code' => '4143',
                'name' => 'Центрошлифовальная',
                'operation_code' => '4130'
            ],
            [
                'code' => '4144',
                'name' => 'Карусельно-шлифовальная',
                'operation_code' => '4130'
            ],
            [
                'code' => '4145',
                'name' => 'Торцешлифовальная',
                'operation_code' => '4130'
            ],
            [
                'code' => '4146',
                'name' => 'Специальная шлифовальная',
                'operation_code' => '4130'
            ],
            [
                'code' => '4147',
                'name' => 'Вальцешлифовальная',
                'operation_code' => '4130'
            ],
            [
                'code' => '4150',
                'name' => 'Зубообрабатывающая',
                'operation_code' => '41'
            ],
            [
                'code' => '4151',
                'name' => 'Зубообрабатывающая',
                'operation_code' => '4150'
            ],
            [
                'code' => '4152',
                'name' => 'Зубодолбежная',
                'operation_code' => '4150'
            ],
            [
                'code' => '4153',
                'name' => '3убофрезерная',
                'operation_code' => '4150'
            ],
            [
                'code' => '4154',
                'name' => 'Зубострогальная',
                'operation_code' => '4150'
            ],
            [
                'code' => '4155',
                'name' => 'Зубопротяжная',
                'operation_code' => '4150'
            ],
            [
                'code' => '4156',
                'name' => '3убозакругляющая',
                'operation_code' => '4150'
            ],
            [
                'code' => '4157',
                'name' => 'Зубошевинговальная',
                'operation_code' => '4150'
            ],
            [
                'code' => '4158',
                'name' => 'Зубопритирочная',
                'operation_code' => '4150'
            ],
            [
                'code' => '4159',
                'name' => 'Зубоприрабатывающая',
                'operation_code' => '4150'
            ],
            [
                'code' => '4161',
                'name' => 'Зубообкатывающая',
                'operation_code' => '4150'
            ],
            [
                'code' => '4162',
                'name' => 'Специальная зубообрабатывающая',
                'operation_code' => '4150'
            ],
            [
                'code' => '4163',
                'name' => 'Зубохонинговальная',
                'operation_code' => '4150'
            ],
            [
                'code' => '4164',
                'name' => 'Зуботокарная',
                'operation_code' => '4150'
            ],
            [
                'code' => '4165',
                'name' => 'Шлицефрезерная',
                'operation_code' => '4150'
            ],
            [
                'code' => '4166',
                'name' => 'Шлицестрогальная',
                'operation_code' => '4150'
            ],
            [
                'code' => '4167',
                'name' => 'Комбинированная',
                'operation_code' => '41'
            ],
            [
                'code' => '4170',
                'name' => 'Строгальная',
                'operation_code' => '41'
            ],
            [
                'code' => '4171',
                'name' => 'Продольно-строгальная',
                'operation_code' => '4170'
            ],
            [
                'code' => '4172',
                'name' => 'Поперечно-строгальная',
                'operation_code' => '4170'
            ],
            [
                'code' => '4173',
                'name' => 'Специальная строгальная',
                'operation_code' => '4170'
            ],
            [
                'code' => '4175',
                'name' => 'Долбежная',
                'operation_code' => '41'
            ],
            [
                'code' => '4180',
                'name' => 'Протяжная',
                'operation_code' => '41'
            ],
            [
                'code' => '4181',
                'name' => 'Горизонтально-протяжная',
                'operation_code' => '4180'
            ],
            [
                'code' => '4182',
                'name' => 'Вертикально-протяжная',
                'operation_code' => '4180'
            ],
            [
                'code' => '4183',
                'name' => 'Специальная протяжная',
                'operation_code' => '4180'
            ],
            [
                'code' => '4190',
                'name' => 'Отделочная',
                'operation_code' => '41'
            ],
            [
                'code' => '4192',
                'name' => 'Хонинговальная',
                'operation_code' => '4190'
            ],
            [
                'code' => '4193',
                'name' => 'Суперфиниширование',
                'operation_code' => '4190'
            ],
            [
                'code' => '4194',
                'name' => 'Доводочная',
                'operation_code' => '4190'
            ],
            [
                'code' => '4195',
                'name' => 'Притирочная',
                'operation_code' => '4190'
            ],
            [
                'code' => '4196',
                'name' => 'Полировальная',
                'operation_code' => '4190'
            ],
            [
                'code' => '4197',
                'name' => 'Глянцовальная',
                'operation_code' => '4190'
            ],
            [
                'code' => '42',
                'name' => 'Обработка резанием',
                'operation_code' => null
            ],
            [
                'code' => '4210',
                'name' => 'Сверлильная',
                'operation_code' => '42'
            ],
            [
                'code' => '4211',
                'name' => 'Сверлильно-центровальная',
                'operation_code' => '4210'
            ],
            [
                'code' => '4212',
                'name' => 'Радиально-сверлильная',
                'operation_code' => '4210'
            ],
            [
                'code' => '4213',
                'name' => 'Горизонтально-сверлильная',
                'operation_code' => '4210'
            ],
            [
                'code' => '4214',
                'name' => 'Вертикально-сверлильная',
                'operation_code' => '4210'
            ],
            [
                'code' => '4216',
                'name' => 'Координатно-сверлильная',
                'operation_code' => '4210'
            ],
            [
                'code' => '4220',
                'name' => 'Расточная',
                'operation_code' => '42'
            ],
            [
                'code' => '4221',
                'name' => 'Горизонтально-расточная',
                'operation_code' => '4220'
            ],
            [
                'code' => '4222',
                'name' => 'Вертикально-расточная',
                'operation_code' => '4220'
            ],
            [
                'code' => '4223',
                'name' => 'Координатно-расточная',
                'operation_code' => '4220'
            ],
            [
                'code' => '4224',
                'name' => 'Алмазно-расточная',
                'operation_code' => '4220'
            ],
            [
                'code' => '4230',
                'name' => 'Программная',
                'operation_code' => '42'
            ],
            [
                'code' => '4231',
                'name' => 'Расточная с ЧПУ',
                'operation_code' => '4230'
            ],
            [
                'code' => '4232',
                'name' => 'Сверлильная с ЧПУ',
                'operation_code' => '4230'
            ],
            [
                'code' => '4233',
                'name' => 'Токарная с ЧПУ',
                'operation_code' => '4230'
            ],
            [
                'code' => '4234',
                'name' => 'Фрезерная с ЧПУ',
                'operation_code' => '4230'
            ],
            [
                'code' => '4236',
                'name' => 'Шлифовальная с ЧПУ',
                'operation_code' => '4230'
            ],
            [
                'code' => '4237',
                'name' => 'Комплексная на обрабатывающих центрах с ЧПУ',
                'operation_code' => '4230'
            ],
            [
                'code' => '4260',
                'name' => 'Фрезерная',
                'operation_code' => '42'
            ],
            [
                'code' => '4261',
                'name' => 'Вертикально-фрезерная',
                'operation_code' => '4260'
            ],
            [
                'code' => '4262',
                'name' => 'Горизонтально-фрезерная',
                'operation_code' => '4260'
            ],
            [
                'code' => '4263',
                'name' => 'Продольно-фрезерная',
                'operation_code' => '4260'
            ],
            [
                'code' => '4264',
                'name' => 'Карусельно-фрезерная',
                'operation_code' => '4260'
            ],
            [
                'code' => '4265',
                'name' => 'Барабанно-фрезерная',
                'operation_code' => '4260'
            ],
            [
                'code' => '4267',
                'name' => 'Копировально-фрезерная',
                'operation_code' => '4260'
            ],
            [
                'code' => '4268',
                'name' => 'Гравировально-фрезерная',
                'operation_code' => '4260'
            ],
            [
                'code' => '4269',
                'name' => 'Фрезерно-центровальная',
                'operation_code' => '4260'
            ],
            [
                'code' => '4271',
                'name' => 'Шпоночно-фрезерная',
                'operation_code' => '4260'
            ],
            [
                'code' => '4272',
                'name' => 'Специальная фрезерная',
                'operation_code' => '4260'
            ],
            [
                'code' => '4273',
                'name' => 'Универсально-фрезерная',
                'operation_code' => '4260'
            ],
            [
                'code' => '4274',
                'name' => 'Резьбофрезерная',
                'operation_code' => '4260'
            ],
            [
                'code' => '4280',
                'name' => 'Отрезная',
                'operation_code' => '42'
            ],
            [
                'code' => '4281',
                'name' => 'Ножовочно-отрезная',
                'operation_code' => '4280'
            ],
            [
                'code' => '4282',
                'name' => 'Ленточно (проволочно)-отрезная',
                'operation_code' => '4280'
            ],
            [
                'code' => '4283',
                'name' => 'Алмазно-отрезая',
                'operation_code' => '4280'
            ],
            [
                'code' => '4284',
                'name' => 'Токарно-отрезная',
                'operation_code' => '4280'
            ],
            [
                'code' => '4285',
                'name' => 'Пило-oтрезная',
                'operation_code' => '4280'
            ],
            [
                'code' => '4286',
                'name' => 'Фрезерно-отрезная',
                'operation_code' => '4280'
            ],
            [
                'code' => '4287',
                'name' => 'Абразивно-отрезная',
                'operation_code' => '4280'
            ],
            [
                'code' => '50',
                'name' => 'Термическая обработка (Собственно термическая обработка)',
                'operation_code' => null
            ],
            [
                'code' => '5000',
                'name' => 'Термическая обработка',
                'operation_code' => '50'
            ],
            [
                'code' => '5010',
                'name' => 'Отжиг',
                'operation_code' => '50'
            ],
            [
                'code' => '5011',
                'name' => 'без фазовых превращений гомогенизационный',
                'operation_code' => '5010'
            ],
            [
                'code' => '5012',
                'name' => 'без фазовых превращений увеличивающий зерно',
                'operation_code' => '5010'
            ],
            [
                'code' => '5014',
                'name' => 'без фазовых превращений графитизирующий',
                'operation_code' => '5010'
            ],
            [
                'code' => '5015',
                'name' => 'без фазовых превращений релаксационный (уменьшающий напряжение)',
                'operation_code' => '5010'
            ],
            [
                'code' => '5016',
                'name' => 'без фазовых превращений промежуточный на возврат',
                'operation_code' => '5010'
            ],
            [
                'code' => '5017',
                'name' => 'рекристаллизационный полный',
                'operation_code' => '5010'
            ],
            [
                'code' => '5018',
                'name' => 'рекристаллизационный неполный',
                'operation_code' => '5010'
            ],
            [
                'code' => '5019',
                'name' => 'дорекристаллизационный упрочняющий',
                'operation_code' => '5010'
            ],
            [
                'code' => '5021',
                'name' => 'дорекристаллизационный смягчающий на отдых',
                'operation_code' => '5010'
            ],
            [
                'code' => '5022',
                'name' => 'дорекристаллизационный смягчающий на возврат',
                'operation_code' => '5010'
            ],
            [
                'code' => '5023',
                'name' => 'с фазовыми превращениями полный гетерогенизирующий',
                'operation_code' => '5010'
            ],
            [
                'code' => '5024',
                'name' => 'с фазовыми превращениями полный гомогенизирующий',
                'operation_code' => '5010'
            ],
            [
                'code' => '5025',
                'name' => 'с фазовыми превращениями изотермический',
                'operation_code' => '5010'
            ],
            [
                'code' => '5026',
                'name' => 'с фазовыми превращениями неполный гетерогенизирующий',
                'operation_code' => '5010'
            ],
            [
                'code' => '5027',
                'name' => 'с фазовыми превращениями неполный гомогенизирующий',
                'operation_code' => '5010'
            ],
            [
                'code' => '5028',
                'name' => 'с фазовыми превращениями сфероидизирующий',
                'operation_code' => '5010'
            ],
            [
                'code' => '5029',
                'name' => 'с фазовыми превращениями нормализационный',
                'operation_code' => '5010'
            ],
            [
                'code' => '5030',
                'name' => 'Закалка',
                'operation_code' => '50'
            ],
            [
                'code' => '5031',
                'name' => 'общая непрерывная в одной среде',
                'operation_code' => '5030'
            ],
            [
                'code' => '5032',
                'name' => 'общая непрерывная возврат после старения',
                'operation_code' => '5030'
            ],
            [
                'code' => '5033',
                'name' => 'общая прерывистая',
                'operation_code' => '5030'
            ],
            [
                'code' => '5034',
                'name' => 'в двух средах',
                'operation_code' => '5033'
            ],
            [
                'code' => '5035',
                'name' => 'многократная',
                'operation_code' => '5033'
            ],
            [
                'code' => '5036',
                'name' => 'с обработкой холодом',
                'operation_code' => '5033'
            ],
            [
                'code' => '5037',
                'name' => 'программированная',
                'operation_code' => '5033'
            ],
            [
                'code' => '5038',
                'name' => 'ступенчатая',
                'operation_code' => '5033'
            ],
            [
                'code' => '5039',
                'name' => 'изотермическая',
                'operation_code' => '5033'
            ],
            [
                'code' => '5041',
                'name' => 'изотермическая с подстуживанием',
                'operation_code' => '5033'
            ],
            [
                'code' => '5042',
                'name' => 'от субкритических температур',
                'operation_code' => '5030'
            ],
            [
                'code' => '5043',
                'name' => 'местная объемная',
                'operation_code' => '5030'
            ],
            [
                'code' => '5044',
                'name' => 'местная поверхностная',
                'operation_code' => '5030'
            ],
            [
                'code' => '5045',
                'name' => 'Термоциклическая обработка (ТЦО)',
                'operation_code' => '50'
            ],
            [
                'code' => '5050',
                'name' => 'Отпуск',
                'operation_code' => '50'
            ],
            [
                'code' => '5051',
                'name' => 'высокий',
                'operation_code' => '5050'
            ],
            [
                'code' => '5052',
                'name' => 'средний',
                'operation_code' => '5050'
            ],
            [
                'code' => '5053',
                'name' => 'вязкий',
                'operation_code' => '5050'
            ],
            [
                'code' => '5054',
                'name' => 'упрочняющий',
                'operation_code' => '5050'
            ],
            [
                'code' => '5056',
                'name' => 'смягчающий',
                'operation_code' => '5050'
            ],
            [
                'code' => '5057',
                'name' => 'ступенчатый',
                'operation_code' => '5050'
            ],
            [
                'code' => '5060',
                'name' => 'Старение',
                'operation_code' => '50'
            ],
            [
                'code' => '5061',
                'name' => 'естественное (без нагрева)',
                'operation_code' => '5060'
            ],
            [
                'code' => '5062',
                'name' => 'искусственное (упрочняющее) полное',
                'operation_code' => '5060'
            ],
            [
                'code' => '5063',
                'name' => 'искусственное (упрочняющее) неполное',
                'operation_code' => '5060'
            ],
            [
                'code' => '5064',
                'name' => 'искусственное (упрочняющее) без предварительной закалки',
                'operation_code' => '5060'
            ],
            [
                'code' => '5066',
                'name' => 'смягчающее (перестраивание)',
                'operation_code' => '5060'
            ],
            [
                'code' => '5067',
                'name' => 'ступенчатое',
                'operation_code' => '5060'
            ],
            [
                'code' => '5068',
                'name' => 'стабилизирующее',
                'operation_code' => '5060'
            ],
            [
                'code' => '51',
                'name' => 'Термическая обработка (Химико-термическая обработка)',
                'operation_code' => null
            ],
            [
                'code' => '5110',
                'name' => 'Диффузионное насыщение металлами',
                'operation_code' => '51'
            ],
            [
                'code' => '5111',
                'name' => 'простое (одноэлементное, одностадийное)',
                'operation_code' => '5110'
            ],
            [
                'code' => '5112',
                'name' => 'комплексное (двухкомпонентное, двухстадийное)',
                'operation_code' => '5110'
            ],
            [
                'code' => '5113',
                'name' => 'комплексное сложное',
                'operation_code' => '5110'
            ],
            [
                'code' => '5120',
                'name' => 'Диффузионное насыщение неметаллами',
                'operation_code' => '51'
            ],
            [
                'code' => '5121',
                'name' => 'простое (одноэлементное, одностадийное)',
                'operation_code' => '5120'
            ],
            [
                'code' => '5122',
                'name' => 'комплексное (двухкомпонентное, двухстадийное',
                'operation_code' => '5120'
            ],
            [
                'code' => '5123',
                'name' => 'комплексное сложное',
                'operation_code' => '5120'
            ],
            [
                'code' => '5130',
                'name' => 'Диффузионное совместное насыщение металлами и неметаллами',
                'operation_code' => '51'
            ],
            [
                'code' => '5135',
                'name' => 'Диффузионное удаление примесей',
                'operation_code' => '51'
            ],
            [
                'code' => '5136',
                'name' => 'простое',
                'operation_code' => '5135'
            ],
            [
                'code' => '5137',
                'name' => 'комплексное',
                'operation_code' => '5135'
            ],
            [
                'code' => '5140',
                'name' => 'Термо-механическая обработка (ТМО)',
                'operation_code' => '51'
            ],
            [
                'code' => '5141',
                'name' => 'предварительная (ПТМО)',
                'operation_code' => '5140'
            ],
            [
                'code' => '5142',
                'name' => 'высокотемпературная (ВТМО)',
                'operation_code' => '5140'
            ],
            [
                'code' => '5143',
                'name' => 'низкотемпературная  (НТМО)',
                'operation_code' => '5140'
            ],
            [
                'code' => '5144',
                'name' => 'высокотемпературная изотермическая (ВТМИзо)',
                'operation_code' => '5140'
            ],
            [
                'code' => '5146',
                'name' => 'низкотемпературная изотермическая (НТМИэо)',
                'operation_code' => '5140'
            ],
            [
                'code' => '5147',
                'name' => 'высоко-низкотемпературная (ВНТМО)',
                'operation_code' => '5140'
            ],
            [
                'code' => '5148',
                'name' => 'предварительная поверхностная (ПТМПО)',
                'operation_code' => '5140'
            ],
            [
                'code' => '5149',
                'name' => 'высокотемпературная поверхностная (ВТМПО)',
                'operation_code' => '5140'
            ],
            [
                'code' => '5151',
                'name' => 'контролируемая прокатка',
                'operation_code' => '5140'
            ],
            [
                'code' => '5152',
                'name' => 'изоформинг',
                'operation_code' => '5140'
            ],
            [
                'code' => '5153',
                'name' => 'термоэлектрохимическая',
                'operation_code' => '5140'
            ],
            [
                'code' => '5154',
                'name' => 'деформационное старение',
                'operation_code' => '5140'
            ],
            [
                'code' => '5156',
                'name' => 'электротермомеханическая',
                'operation_code' => '5140'
            ],
            [
                'code' => '5157',
                'name' => 'термомагнитная',
                'operation_code' => '5140'
            ],
            [
                'code' => '5161',
                'name' => 'Вжигание',
                'operation_code' => '51'
            ],
            [
                'code' => '5162',
                'name' => 'Осаждение пленки',
                'operation_code' => '51'
            ],
            [
                'code' => '5163',
                'name' => 'Ионная имплантация',
                'operation_code' => '51'
            ],
            [
                'code' => '5164',
                'name' => 'Наращивание эпитаксиального слоя',
                'operation_code' => '51'
            ],
            [
                'code' => '5166',
                'name' => 'Наращивание поликремния',
                'operation_code' => '51'
            ],
            [
                'code' => '5167',
                'name' => 'Сплавление',
                'operation_code' => '51'
            ],
            [
                'code' => '5168',
                'name' => 'Обжиг',
                'operation_code' => '51'
            ],
            [
                'code' => '55',
                'name' => 'Фотохимико-физическая обработка',
                'operation_code' => null
            ],
            [
                'code' => '5500',
                'name' => 'Фотохимико-физическая обработка',
                'operation_code' => '55'
            ],
            [
                'code' => '5510',
                'name' => 'Изготовление оригинала',
                'operation_code' => '55'
            ],
            [
                'code' => '5511',
                'name' => 'пересчетом таблицы координат',
                'operation_code' => '5510'
            ],
            [
                'code' => '5512',
                'name' => 'вырезанием',
                'operation_code' => '5510'
            ],
            [
                'code' => '5513',
                'name' => 'на автоматическом координатографе',
                'operation_code' => '5512'
            ],
            [
                'code' => '5514',
                'name' => 'на координатографе в режиме ручного ввода информации',
                'operation_code' => '5512'
            ],
            [
                'code' => '5515',
                'name' => 'фотонабором',
                'operation_code' => '5510'
            ],
            [
                'code' => '5516',
                'name' => 'аппликацией',
                'operation_code' => '5510'
            ],
            [
                'code' => '5517',
                'name' => 'комбинированным способом',
                'operation_code' => '5510'
            ],
            [
                'code' => '5520',
                'name' => 'Изготовление фотошаблонов',
                'operation_code' => '55'
            ],
            [
                'code' => '5521',
                'name' => 'Съемка репродукционной камерой',
                'operation_code' => '5520'
            ],
            [
                'code' => '5522',
                'name' => 'Обработка фотоматериалов',
                'operation_code' => '5520'
            ],
            [
                'code' => '5523',
                'name' => 'Фотопечать',
                'operation_code' => '5520'
            ],
            [
                'code' => '5524',
                'name' => 'Ретуширование',
                'operation_code' => '5520'
            ],
            [
                'code' => '5525',
                'name' => 'Мультиплицирование',
                'operation_code' => '5520'
            ],
            [
                'code' => '5526',
                'name' => 'Изготовление промежуточного фотошаблона',
                'operation_code' => '5520'
            ],
            [
                'code' => '5527',
                'name' => 'Изготовление копий промежуточного фотошаблона',
                'operation_code' => '5520'
            ],
            [
                'code' => '5528',
                'name' => 'Изготовление эталонного фотошаблона',
                'operation_code' => '5520'
            ],
            [
                'code' => '5529',
                'name' => 'Изготовление рабочего фотошаблона',
                'operation_code' => '5520'
            ],
            [
                'code' => '5540',
                'name' => 'Фотолитография',
                'operation_code' => '55'
            ],
            [
                'code' => '5541',
                'name' => 'Экспонирование',
                'operation_code' => '5540'
            ],
            [
                'code' => '5542',
                'name' => 'контактное',
                'operation_code' => '5541'
            ],
            [
                'code' => '5543',
                'name' => 'бесконтактное (проекционное)',
                'operation_code' => '5541'
            ],
            [
                'code' => '5544',
                'name' => 'совмещенное',
                'operation_code' => '5541'
            ],
            [
                'code' => '5545',
                'name' => 'Проявление',
                'operation_code' => '5540'
            ],
            [
                'code' => '5546',
                'name' => 'Задубливание (полимеризация), фиксирование',
                'operation_code' => '5540'
            ],
            [
                'code' => '5547',
                'name' => 'Сенсибилизация',
                'operation_code' => '5540'
            ],
            [
                'code' => '60',
                'name' => 'Формообразование из полимерных материалов, керамики, стекла и резины',
                'operation_code' => null
            ],
            [
                'code' => '6000',
                'name' => 'Формообразование из полимерных материалов, керамики, стекла и резины',
                'operation_code' => '60'
            ],
            [
                'code' => '6009',
                'name' => 'Смешивание',
                'operation_code' => '60'
            ],
            [
                'code' => '6011',
                'name' => 'Окрашивание',
                'operation_code' => '60'
            ],
            [
                'code' => '6012',
                'name' => 'Дробление',
                'operation_code' => '60'
            ],
            [
                'code' => '6013',
                'name' => 'Гранулирование',
                'operation_code' => '60'
            ],
            [
                'code' => '6014',
                'name' => 'Таблетирование',
                'operation_code' => '60'
            ],
            [
                'code' => '6015',
                'name' => 'Жгутирование',
                'operation_code' => '60'
            ],
            [
                'code' => '6016',
                'name' => 'Шприцевание',
                'operation_code' => '60'
            ],
            [
                'code' => '6017',
                'name' => 'Набор пакета',
                'operation_code' => '60'
            ],
            [
                'code' => '6020',
                'name' => 'Прессование',
                'operation_code' => '60'
            ],
            [
                'code' => '6021',
                'name' => 'прямое',
                'operation_code' => '6020'
            ],
            [
                'code' => '6022',
                'name' => 'литьевое',
                'operation_code' => '6020'
            ],
            [
                'code' => '6023',
                'name' => 'с декорированием',
                'operation_code' => '6020'
            ],
            [
                'code' => '6030',
                'name' => 'Литье',
                'operation_code' => '60'
            ],
            [
                'code' => '6031',
                'name' => 'под давлением термопластов',
                'operation_code' => '6030'
            ],
            [
                'code' => '6032',
                'name' => 'под давлением реактопластов',
                'operation_code' => '6030'
            ],
            [
                'code' => '6033',
                'name' => 'под давлением со вспениванием физическим',
                'operation_code' => '6030'
            ],
            [
                'code' => '6034',
                'name' => 'под давлением со вспениванием химическим',
                'operation_code' => '6030'
            ],
            [
                'code' => '6036',
                'name' => 'многокомпонентное',
                'operation_code' => '6030'
            ],
            [
                'code' => '6037',
                'name' => 'центробежное',
                'operation_code' => '6030'
            ],
            [
                'code' => '6040',
                'name' => 'Вспенивание',
                'operation_code' => '60'
            ],
            [
                'code' => '6041',
                'name' => 'прессовое',
                'operation_code' => '6040'
            ],
            [
                'code' => '6042',
                'name' => 'беспрессовое',
                'operation_code' => '6040'
            ],
            [
                'code' => '6050',
                'name' => 'Экструзия',
                'operation_code' => '60'
            ],
            [
                'code' => '6051',
                'name' => 'заготовок',
                'operation_code' => '6050'
            ],
            [
                'code' => '6052',
                'name' => 'с непрерывным калиброванием',
                'operation_code' => '6050'
            ],
            [
                'code' => '6053',
                'name' => 'с непрерывным раздувом',
                'operation_code' => '6050'
            ],
            [
                'code' => '6056',
                'name' => 'Соэкструзия',
                'operation_code' => '60'
            ],
            [
                'code' => '6057',
                'name' => 'Интрузия',
                'operation_code' => '60'
            ],
            [
                'code' => '6060',
                'name' => 'Формование',
                'operation_code' => '60'
            ],
            [
                'code' => '6061',
                'name' => 'герметичной эластичной упаковкой',
                'operation_code' => '6060'
            ],
            [
                'code' => '6062',
                'name' => 'пуансоном и матрицей',
                'operation_code' => '6060'
            ],
            [
                'code' => '6063',
                'name' => 'на оправке',
                'operation_code' => '6060'
            ],
            [
                'code' => '6064',
                'name' => 'контактное',
                'operation_code' => '6060'
            ],
            [
                'code' => '6065',
                'name' => 'протяжным кольцом',
                'operation_code' => '6060'
            ],
            [
                'code' => '6066',
                'name' => 'термовакуумное',
                'operation_code' => '6060'
            ],
            [
                'code' => '6067',
                'name' => 'термопневматическое',
                'operation_code' => '6060'
            ],
            [
                'code' => '6068',
                'name' => 'комбинированное',
                'operation_code' => '6060'
            ],
            [
                'code' => '6069',
                'name' => 'экструзионно-раздувное',
                'operation_code' => '6060'
            ],
            [
                'code' => '6073',
                'name' => 'Армирование',
                'operation_code' => '60'
            ],
            [
                'code' => '6074',
                'name' => 'Термоштампование',
                'operation_code' => '60'
            ],
            [
                'code' => '6076',
                'name' => 'Дублирование',
                'operation_code' => '60'
            ],
            [
                'code' => '6077',
                'name' => 'Ламинирование',
                'operation_code' => '60'
            ],
            [
                'code' => '6078',
                'name' => 'Каландрирование',
                'operation_code' => '60'
            ],
            [
                'code' => '6079',
                'name' => 'Вальцевание',
                'operation_code' => '60'
            ],
            [
                'code' => '6081',
                'name' => 'Тиснение',
                'operation_code' => '60'
            ],
            [
                'code' => '6082',
                'name' => 'Спекание',
                'operation_code' => '60'
            ],
            [
                'code' => '6083',
                'name' => 'Растяжение',
                'operation_code' => '60'
            ],
            [
                'code' => '6084',
                'name' => 'Стерилизация',
                'operation_code' => '60'
            ],
            [
                'code' => '6085',
                'name' => 'Вулканизация',
                'operation_code' => '60'
            ],
            [
                'code' => '6086',
                'name' => 'горячая в прессах',
                'operation_code' => '6085'
            ],
            [
                'code' => '6087',
                'name' => 'горячая в автоклав-прессах',
                'operation_code' => '6085'
            ],
            [
                'code' => '6088',
                'name' => 'горячая на открытом вoздухе',
                'operation_code' => '6085'
            ],
            [
                'code' => '6089',
                'name' => 'холодная радиационная',
                'operation_code' => '6085'
            ],
            [
                'code' => '6090',
                'name' => 'Гуммирование',
                'operation_code' => '60'
            ],
            [
                'code' => '6091',
                'name' => 'горячее',
                'operation_code' => '6090'
            ],
            [
                'code' => '6092',
                'name' => 'холодное',
                'operation_code' => '6090'
            ],
            [
                'code' => '6093',
                'name' => 'Желатинирование',
                'operation_code' => '60'
            ],
            [
                'code' => '6094',
                'name' => 'Прорезинивание',
                'operation_code' => '60'
            ],
            [
                'code' => '6095',
                'name' => 'Девулканизация',
                'operation_code' => '60'
            ],
            [
                'code' => '6096',
                'name' => 'в прессах',
                'operation_code' => '6095'
            ],
            [
                'code' => '6097',
                'name' => 'радиационная',
                'operation_code' => '6095'
            ],
            [
                'code' => '6098',
                'name' => 'Пластикация каучука',
                'operation_code' => '60'
            ],
            [
                'code' => '6099',
                'name' => 'Выдувание',
                'operation_code' => '60'
            ],
            [
                'code' => '65',
                'name' => 'Порошковая металлургия',
                'operation_code' => null,
            ],
            [
                'code' => '6500',
                'name' => 'Порошковая металлургия',
                'operation_code' => '65',
            ],
            [
                'code' => '6530',
                'name' => 'Формование порошков',
                'operation_code' => '65',
            ],
            [
                'code' => '6531',
                'name' => 'с приложением статического давления без нагрева прессованием без оболочки',
                'operation_code' => '6530',
            ],
            [
                'code' => '6532',
                'name' => 'с приложением статического давления без нагрева прессованием в оболочке',
                'operation_code' => '6530',
            ],
            [
                'code' => '6533',
                'name' => 'с приложением статического давления без нагрева прокаткой без оболочки',
                'operation_code' => '6530',
            ],
            [
                'code' => '6534',
                'name' => 'с приложением статического давления без нагрева прокаткой в оболочке',
                'operation_code' => '6530',
            ],
            [
                'code' => '6535',
                'name' => 'с приложением статического давления без нагрева протяжкой без оболочки',
                'operation_code' => '6530',
            ],
            [
                'code' => '6536',
                'name' => 'с приложением статического давления без нагрева протяжкой в оболочке',
                'operation_code' => '6530',
            ],
            [
                'code' => '6537',
                'name' => 'с приложением статического давления без нагрева выдавливанием без оболочки',
                'operation_code' => '6530',
            ],
            [
                'code' => '6539',
                'name' => 'с приложением статического давления с нагревом прессованием в оболочке',
                'operation_code' => '6530',
            ],
            [
                'code' => '6541',
                'name' => 'с приложением статического давления с нагревом прокаткой без оболочки',
                'operation_code' => '6530',
            ],
            [
                'code' => '6542',
                'name' => 'с приложением статического давления с нагревом прокаткой в оболочке',
                'operation_code' => '6530',
            ],
            [
                'code' => '6544',
                'name' => 'с приложением статического давления с нагревом выдавливанием в оболочке',
                'operation_code' => '6530',
            ],
            [
                'code' => '6545',
                'name' => 'с приложением динамического давления без нагрева прессованием без оболочки',
                'operation_code' => '6530',
            ],
            [
                'code' => '6546',
                'name' => 'с приложением динамического давления без нагрева прессованием в оболочке',
                'operation_code' => '6530',
            ],
            [
                'code' => '6548',
                'name' => 'с приложением динамического давления с нагревом прессованием в оболочке',
                'operation_code' => '6530',
            ],
            [
                'code' => '6551',
                'name' => 'с приложением динамического давления с нагревом выдавливанием в оболочке',
                'operation_code' => '6530',
            ],
            [
                'code' => '6552',
                'name' => 'с приложением динамического давления с нагревом ковкой в оболочке',
                'operation_code' => '6530',
            ],
            [
                'code' => '6553',
                'name' => 'с приложением циклического давления без нагрева прессованием без оболочки',
                'operation_code' => '6530',
            ],
            [
                'code' => '6554',
                'name' => 'с приложением циклического давления с нагревом прессованием без оболочки',
                'operation_code' => '6530',
            ],
            [
                'code' => '6555',
                'name' => 'Формование без нагрева под воздействием вибрации',
                'operation_code' => '6530',
            ],
            [
                'code' => '6556',
                'name' => 'Формование без нагрева и приложения давления пластифицированных масс',
                'operation_code' => '6530',
            ],
            [
                'code' => '6557',
                'name' => 'Формование без нагрева и приложения давления свободно насыпного порошка',
                'operation_code' => '6530',
            ],
            [
                'code' => '6558',
                'name' => 'Формование без нагрева и приложения давления шликера',
                'operation_code' => '6530',
            ],
            [
                'code' => '6560',
                'name' => 'Уплотнением порошковых формовок',
                'operation_code' => '6530',
            ],
            [
                'code' => '6561',
                'name' => 'с приложением статического давления без нагрева прессованием без оболочки',
                'operation_code' => '6530',
            ],
            [
                'code' => '6562',
                'name' => 'с приложением статического давления без нагрева прессованием в оболочке',
                'operation_code' => '6530',
            ],
            [
                'code' => '6563',
                'name' => 'с приложением статического давления без нагрева прокаткой без оболочки',
                'operation_code' => '6530',
            ],
            [
                'code' => '6564',
                'name' => 'с приложением статического давления без нагрева прокаткой в оболочке',
                'operation_code' => '6530',
            ],
            [
                'code' => '6565',
                'name' => 'с приложением статического давления без нагрева выдавливанием без оболочки',
                'operation_code' => '6530',
            ],
            [
                'code' => '6566',
                'name' => 'с приложением статического давления без нагрева выдавливанием в оболочке',
                'operation_code' => '6530',
            ],
            [
                'code' => '6567',
                'name' => 'с приложением статического давления с нагревом прессованием без оболочки',
                'operation_code' => '6530',
            ],
            [
                'code' => '6568',
                'name' => 'с приложением статического давления с нагревом прессованием в оболочке',
                'operation_code' => '6530',
            ],
            [
                'code' => '6569',
                'name' => 'с приложением статического давления с нагревом прокаткой в оболочке',
                'operation_code' => '6530',
            ],
            [
                'code' => '6571',
                'name' => 'с приложением статического давления с нагревом выдавливанием в оболочке',
                'operation_code' => '6530',
            ],
            [
                'code' => '6572',
                'name' => 'с приложением динамического давления без нагрева прессованием без оболочки',
                'operation_code' => '6530',
            ],
            [
                'code' => '6573',
                'name' => 'с приложением динамического давления без нагрева прессованием в оболочке',
                'operation_code' => '6530',
            ],
            [
                'code' => '6574',
                'name' => 'с приложением динамического давления с нагревом прессованием без оболочки',
                'operation_code' => '6530',
            ],
            [
                'code' => '6575',
                'name' => 'с приложением динамического давления с нагревом прессованием в оболочке',
                'operation_code' => '6530',
            ],
            [
                'code' => '6576',
                'name' => 'с приложением динамического давления с нагревом выдавливанием в оболочке',
                'operation_code' => '6530',
            ],
            [
                'code' => '6577',
                'name' => 'с приложением динамического давления с нагревом ковкой в оболочке',
                'operation_code' => '6530',
            ],
            [
                'code' => '6578',
                'name' => 'с приложением циклического давления с нагревом прессованием без оболочки',
                'operation_code' => '6530',
            ],
            [
                'code' => '6580',
                'name' => 'Спекание порошковых формовок',
                'operation_code' => '6530',
            ],
            [
                'code' => '6581',
                'name' => 'при низком давлении (в вакууме) защитной (газовой) среды неактивированное',
                'operation_code' => '6580',
            ],
            [
                'code' => '6582',
                'name' => 'при низком давлении (в вакууме) защитной (газовой) среды активированное с введением активирующих факторов в порошковую формовку',
                'operation_code' => '6580',
            ],
            [
                'code' => '6583',
                'name' => 'при низком давлении (в вакууме) защитной (газовой) среды активированное с приложением к порошковой формовке давления статического',
                'operation_code' => '6582',
            ],
            [
                'code' => '6584',
                'name' => 'при низком давлении (в вакууме) защитной (газовой) среды активированное с приложением к порошковой формовке давления циклического',
                'operation_code' => '6582',
            ],
            [
                'code' => '6585',
                'name' => 'при низком давлении (в вакууме) защитной (газовой) среды активированное с циклическим изменением температуры',
                'operation_code' => '6581',
            ],
            [
                'code' => '6586',
                'name' => 'при низком давлении (в вакууме) защитной (газовой) среды активированное с инфильтрацией',
                'operation_code' => '6581',
            ],
            [
                'code' => '6587',
                'name' => 'при нормальном давлении защитной (газовой, сыпучей, жидкой среды) неактивированное',
                'operation_code' => '6580',
            ],
            [
                'code' => '6588',
                'name' => 'при нормальном давлении защитной (газовой, сыпучей, жидкой среды) активированное с введением активирующих факторов в защитную среду',
                'operation_code' => '6580',
            ],
            [
                'code' => '6589',
                'name' => 'при нормальном давлении защитной (газовой, сыпучей, жидкой среды) активированное с введением активирующих факторов в порошковую формовку',
                'operation_code' => '6580',
            ],
            [
                'code' => '6591',
                'name' => 'при нормальном давлении защитной (газовой, сыпучей, жидкой среды) активированное с приложением к порошковой формовке давления статического',
                'operation_code' => '6580',
            ],
            [
                'code' => '6592',
                'name' => 'при нормальном давлении защитной (газовой, сыпучей, жидкой среды) активированное с приложением к порошковой формовке давления циклического',
                'operation_code' => '6580',
            ],
            [
                'code' => '6593',
                'name' => 'при нормальном давлении защитной (газовой, сыпучей, жидкой среды) активированное с циклическим изменением температуры',
                'operation_code' => '6580',
            ],
            [
                'code' => '6594',
                'name' => 'при нормальном давлении защитной (газовой, сыпучей, жидкой среды) активированное с инфильтрацией',
                'operation_code' => '6580',
            ],
            [
                'code' => '6595',
                'name' => 'при высоком давлении защитной (газовой, сыпучей, жидкой) среды неактивированное',
                'operation_code' => '6580',
            ],
            [
                'code' => '6596',
                'name' => 'при высоком давлении защитной (газовой, сыпучей, жидкой) среды активированное с введением активирующих факторов в защитную среду',
                'operation_code' => '6580',
            ],
            [
                'code' => '6597',
                'name' => 'при высоком давлении защитной (газовой, сыпучей, жидкой) среды активированное с введением активирующих факторов в порошковую формовку',
                'operation_code' => '6580',
            ],
            [
                'code' => '6598',
                'name' => 'при высоком давлении защитной (газовой, сыпучей, жидкой) среды активированное с циклическим изменением температуры',
                'operation_code' => '6580',
            ],
            [
                'code' => '71',
                'name' => 'Получение покрытий (металлических и неметаллических неорганических)',
                'operation_code' => null
            ],
            [
                'code' => '7100',
                'name' => 'Получение покрытий',
                'operation_code' => '71'
            ],
            [
                'code' => '7101',
                'name' => 'Крацевание',
                'operation_code' => '71'
            ],
            [
                'code' => '7102',
                'name' => 'Сатинирование химическое',
                'operation_code' => '71'
            ],
            [
                'code' => '7103',
                'name' => 'Сатинирование электрохимическое',
                'operation_code' => '7102'
            ],
            [
                'code' => '7104',
                'name' => 'Эмалирование, глазурование',
                'operation_code' => '71'
            ],
            [
                'code' => '7105',
                'name' => 'Тонирование химическое',
                'operation_code' => '71'
            ],
            [
                'code' => '7106',
                'name' => 'Тонирование электрохимическое',
                'operation_code' => '7105'
            ],
            [
                'code' => '7107',
                'name' => 'Матирование',
                'operation_code' => '71'
            ],
            [
                'code' => '7108',
                'name' => 'Осветление',
                'operation_code' => '71'
            ],
            [
                'code' => '7109',
                'name' => 'Хроматирование',
                'operation_code' => '71'
            ],
            [
                'code' => '7110',
                'name' => 'Металлизация',
                'operation_code' => '71'
            ],
            [
                'code' => '7111',
                'name' => 'газотермическая пламенная',
                'operation_code' => '7110'
            ],
            [
                'code' => '7112',
                'name' => 'газотермическая электродуговая',
                'operation_code' => '7110'
            ],
            [
                'code' => '7113',
                'name' => 'газотермическая плазменная',
                'operation_code' => '7110'
            ],
            [
                'code' => '7114',
                'name' => 'газотермическая детонационная',
                'operation_code' => '7110'
            ],
            [
                'code' => '7115',
                'name' => 'газотермическая высокочастотная',
                'operation_code' => '7110'
            ],
            [
                'code' => '7116',
                'name' => 'конденсационная (вакуумная) катодная',
                'operation_code' => '7110'
            ],
            [
                'code' => '7117',
                'name' => 'конденсационная (вакуумная) термическая',
                'operation_code' => '7110'
            ],
            [
                'code' => '7118',
                'name' => 'конденсационная (вакуумная) ионная',
                'operation_code' => '7110'
            ],
            [
                'code' => '7119',
                'name' => 'Нейтрализация',
                'operation_code' => '71'
            ],
            [
                'code' => '7121',
                'name' => 'Золочение химическое',
                'operation_code' => '71'
            ],
            [
                'code' => '7122',
                'name' => 'Золочение электрохимическое',
                'operation_code' => '71'
            ],
            [
                'code' => '7123',
                'name' => 'Амальгамирование',
                'operation_code' => '71'
            ],
            [
                'code' => '7124',
                'name' => 'Восстановление катодное',
                'operation_code' => '71'
            ],
            [
                'code' => '7125',
                'name' => 'Плакирование',
                'operation_code' => '71'
            ],
            [
                'code' => '7126',
                'name' => 'Активация химическая',
                'operation_code' => '71'
            ],
            [
                'code' => '7127',
                'name' => 'Активация электрохимическая',
                'operation_code' => '71'
            ],
            [
                'code' => '7128',
                'name' => 'Наполнение покрытия в воде',
                'operation_code' => '71'
            ],
            [
                'code' => '7129',
                'name' => 'Наполнение покрытия в растворе красителя',
                'operation_code' => '71'
            ],
            [
                'code' => '7131',
                'name' => 'Гидрофобизирование покрытия',
                'operation_code' => '71'
            ],
            [
                'code' => '7132',
                'name' => 'Оплавление покрытия',
                'operation_code' => '71'
            ],
            [
                'code' => '7133',
                'name' => 'Алюминирование металлизационное',
                'operation_code' => '71'
            ],
            [
                'code' => '7134',
                'name' => 'Алюминирование электрохимическое',
                'operation_code' => '71'
            ],
            [
                'code' => '7135',
                'name' => 'Пассивирование',
                'operation_code' => '71'
            ],
            [
                'code' => '7136',
                'name' => 'Фосфатирование химическое',
                'operation_code' => '71'
            ],
            [
                'code' => '7137',
                'name' => 'Фосфатирование электрохимическое',
                'operation_code' => '71'
            ],
            [
                'code' => '7139',
                'name' => 'Флюсование',
                'operation_code' => '71'
            ],
            [
                'code' => '7141',
                'name' => 'Окисление химическое',
                'operation_code' => '71'
            ],
            [
                'code' => '7142',
                'name' => 'Окисление электрохимическое',
                'operation_code' => '71'
            ],
            [
                'code' => '7143',
                'name' => 'Окисление термическое',
                'operation_code' => '71'
            ],
            [
                'code' => '7144',
                'name' => 'Эмалирование',
                'operation_code' => '71'
            ],
            [
                'code' => '7145',
                'name' => 'Железнение электрохимическое',
                'operation_code' => '71'
            ],
            [
                'code' => '7146',
                'name' => 'Железнение металлизационное',
                'operation_code' => '71'
            ],
            [
                'code' => '7147',
                'name' => 'Индирование',
                'operation_code' => '71'
            ],
            [
                'code' => '7148',
                'name' => 'Кадмирование электрохимическое',
                'operation_code' => '71'
            ],
            [
                'code' => '7149',
                'name' => 'Кадмирование металлизационное',
                'operation_code' => '71'
            ],
            [
                'code' => '7151',
                'name' => 'Оловянирование металлизационное',
                'operation_code' => '71'
            ],
            [
                'code' => '7152',
                'name' => 'Оловянирование химическое',
                'operation_code' => '71'
            ],
            [
                'code' => '7153',
                'name' => 'Оловянирование электрохимическое',
                'operation_code' => '71'
            ],
            [
                'code' => '7154',
                'name' => 'Оловянирование горячее',
                'operation_code' => '71'
            ],
            [
                'code' => '7155',
                'name' => 'Меднение химическое',
                'operation_code' => '71'
            ],
            [
                'code' => '7156',
                'name' => 'Меднение электрохимическое',
                'operation_code' => '71'
            ],
            [
                'code' => '7157',
                'name' => 'Меднение металлизационное',
                'operation_code' => '71'
            ],
            [
                'code' => '7158',
                'name' => 'Родирование',
                'operation_code' => '71'
            ],
            [
                'code' => '7159',
                'name' => 'Палладирование химическое',
                'operation_code' => '71'
            ],
            [
                'code' => '7161',
                'name' => 'Палладирование электрохимическое',
                'operation_code' => '71'
            ],
            [
                'code' => '7162',
                'name' => 'Платинирование',
                'operation_code' => '71'
            ],
            [
                'code' => '7163',
                'name' => 'Никелерование химическое',
                'operation_code' => '71'
            ],
            [
                'code' => '7164',
                'name' => 'Никелерование электрохимическое',
                'operation_code' => '71'
            ],
            [
                'code' => '7165',
                'name' => 'Свинцевание химическое',
                'operation_code' => '71'
            ],
            [
                'code' => '7166',
                'name' => 'Свинцевание электрохимическое',
                'operation_code' => '71'
            ],
            [
                'code' => '7167',
                'name' => 'Свинцевание горячее',
                'operation_code' => '71'
            ],
            [
                'code' => '7168',
                'name' => 'Свинцевание металлизационное',
                'operation_code' => '71'
            ],
            [
                'code' => '7169',
                'name' => 'Серебрение химическое',
                'operation_code' => '71'
            ],
            [
                'code' => '7171',
                'name' => 'Серебрение электрохимическое',
                'operation_code' => '71'
            ],
            [
                'code' => '7172',
                'name' => 'Хромирование',
                'operation_code' => '71'
            ],
            [
                'code' => '7173',
                'name' => 'Цинкование химическое',
                'operation_code' => '71'
            ],
            [
                'code' => '7174',
                'name' => 'Цинкование электрохимическое',
                'operation_code' => '71'
            ],
            [
                'code' => '7175',
                'name' => 'Цинкование горячее',
                'operation_code' => '71'
            ],
            [
                'code' => '7176',
                'name' => 'Цинкование металлизационное',
                'operation_code' => '71'
            ],
            [
                'code' => '7180',
                'name' => 'Получение покрытия сплавами',
                'operation_code' => '71'
            ],
            [
                'code' => '73',
                'name' => 'Получение покрытий органических (лакокрасочных)',
                'operation_code' => null
            ],
            [
                'code' => '7300',
                'name' => 'Получение покрытий органических (лакокрасочных)',
                'operation_code' => '73'
            ],
            [
                'code' => '7301',
                'name' => 'Преобразование ржавчины распылением',
                'operation_code' => '73'
            ],
            [
                'code' => '7302',
                'name' => 'Преобразование ржавчины кистью, тампоном',
                'operation_code' => '73'
            ],
            [
                'code' => '7303',
                'name' => 'Порозаполнение древесины',
                'operation_code' => '73'
            ],
            [
                'code' => '7304',
                'name' => 'Крашение древесины',
                'operation_code' => '73'
            ],
            [
                'code' => '7310',
                'name' => 'Грунтование',
                'operation_code' => '73'
            ],
            [
                'code' => '7311',
                'name' => 'распылением пневматическим',
                'operation_code' => '7310'
            ],
            [
                'code' => '7312',
                'name' => 'распылением безвоздушным',
                'operation_code' => '7310'
            ],
            [
                'code' => '7313',
                'name' => 'распылением электростатическим',
                'operation_code' => '7310'
            ],
            [
                'code' => '7314',
                'name' => 'распылением пневмоэлектростатическим',
                'operation_code' => '7310'
            ],
            [
                'code' => '7315',
                'name' => 'распылением безвоздушным электростатическим',
                'operation_code' => '7310'
            ],
            [
                'code' => '7325',
                'name' => 'распылением аэрозольным',
                'operation_code' => '7310'
            ],
            [
                'code' => '7326',
                'name' => 'распылением центробежным',
                'operation_code' => '7310'
            ],
            [
                'code' => '7327',
                'name' => 'распылением ультразвуковым',
                'operation_code' => '7310'
            ],
            [
                'code' => '7328',
                'name' => 'окунанием без выдержки в парах растворителя',
                'operation_code' => '7310'
            ],
            [
                'code' => '7329',
                'name' => 'окунанием с выдержкой в парах растворителя',
                'operation_code' => '7310'
            ],
            [
                'code' => '7331',
                'name' => 'электроосаждением анодным',
                'operation_code' => '7310'
            ],
            [
                'code' => '7332',
                'name' => 'электроосаждением катодным',
                'operation_code' => '7310'
            ],
            [
                'code' => '7333',
                'name' => 'наливом, обливом',
                'operation_code' => '7310'
            ],
            [
                'code' => '7334',
                'name' => 'струйным обливом без выдержки в парах растворителя',
                'operation_code' => '7310'
            ],
            [
                'code' => '7335',
                'name' => 'струйным обливом с выдержкой в парах растворителя',
                'operation_code' => '7310'
            ],
            [
                'code' => '7336',
                'name' => 'в барабанах, центрифугах',
                'operation_code' => '7310'
            ],
            [
                'code' => '7337',
                'name' => 'кистью, валиком, тампоном и др.',
                'operation_code' => '7310'
            ],
            [
                'code' => '7338',
                'name' => 'валками',
                'operation_code' => '7310'
            ],
            [
                'code' => '7339',
                'name' => 'автоосаждением',
                'operation_code' => '7310'
            ],
            [
                'code' => '7340',
                'name' => 'Подгрунтовывание',
                'operation_code' => '73'
            ],
            [
                'code' => '7341',
                'name' => 'кистью, валиком, тампоном и др.',
                'operation_code' => '7340'
            ],
            [
                'code' => '7342',
                'name' => 'распылением',
                'operation_code' => '7340'
            ],
            [
                'code' => '7350',
                'name' => 'Шпатлевание',
                'operation_code' => '73'
            ],
            [
                'code' => '7351',
                'name' => 'шпатлевание',
                'operation_code' => '7350'
            ],
            [
                'code' => '7352',
                'name' => 'шпатлевание',
                'operation_code' => '7350'
            ],
            [
                'code' => '7356',
                'name' => 'Получение выявительного слоя',
                'operation_code' => '73'
            ],
            [
                'code' => '7360',
                'name' => 'Окрашивание',
                'operation_code' => '73'
            ],
            [
                'code' => '7361',
                'name' => 'распылением пневматическим',
                'operation_code' => '7360'
            ],
            [
                'code' => '7362',
                'name' => 'распылением воздушным',
                'operation_code' => '7360'
            ],
            [
                'code' => '7363',
                'name' => 'распылением электростатическим',
                'operation_code' => '7360'
            ],
            [
                'code' => '7364',
                'name' => 'распылением пневмоэлектростатическим',
                'operation_code' => '7360'
            ],
            [
                'code' => '7366',
                'name' => 'распылением безвоздушным электростатическим',
                'operation_code' => '7360'
            ],
            [
                'code' => '7367',
                'name' => 'распылением аэрозольным',
                'operation_code' => '7360'
            ],
            [
                'code' => '7368',
                'name' => 'распылением ультразвуковым',
                'operation_code' => '7360'
            ],
            [
                'code' => '7369',
                'name' => 'окунанием без выдержки в парах растворителя',
                'operation_code' => '7360'
            ],
            [
                'code' => '7371',
                'name' => 'окунанием с выдержкой в парах растворителя',
                'operation_code' => '7360'
            ],
            [
                'code' => '7372',
                'name' => 'электроосаждением анодным',
                'operation_code' => '7360'
            ],
            [
                'code' => '7373',
                'name' => 'электроосаждением катодным',
                'operation_code' => '7360'
            ],
            [
                'code' => '7374',
                'name' => 'автоосаждением',
                'operation_code' => '7360'
            ],
            [
                'code' => '7375',
                'name' => 'обливом, наливом',
                'operation_code' => '7360'
            ],
            [
                'code' => '7376',
                'name' => 'валками',
                'operation_code' => '7360'
            ],
            [
                'code' => '7377',
                'name' => 'в барабанах, центрифугах',
                'operation_code' => '7360'
            ],
            [
                'code' => '7378',
                'name' => 'кистью, валиком, тампоном, иглой и др.',
                'operation_code' => '7360'
            ],
            [
                'code' => '7379',
                'name' => 'струйным обливом без выдержки в парах растворителя',
                'operation_code' => '7360'
            ],
            [
                'code' => '7381',
                'name' => 'струйным обливом с выдержкой в парах растворителя',
                'operation_code' => '7360'
            ],
            [
                'code' => '7382',
                'name' => 'в псевдоожиженном слое',
                'operation_code' => '7360'
            ],
            [
                'code' => '7385',
                'name' => 'Подкрашивание',
                'operation_code' => '73'
            ],
            [
                'code' => '7386',
                'name' => 'кистью, валиком, тампоном, иглой и др.',
                'operation_code' => '7385'
            ],
            [
                'code' => '7387',
                'name' => 'распылением',
                'operation_code' => '7385'
            ],
            [
                'code' => '74',
                'name' => 'Получение покрытий органических (лакокрасочных)',
                'operation_code' => null
            ],
            [
                'code' => '7410',
                'name' => 'Лакирование',
                'operation_code' => '74'
            ],
            [
                'code' => '7411',
                'name' => 'распылением пневматическим',
                'operation_code' => '7410'
            ],
            [
                'code' => '7412',
                'name' => 'распылением безвоздушным',
                'operation_code' => '7410'
            ],
            [
                'code' => '7413',
                'name' => 'распылением электростатическим',
                'operation_code' => '7410'
            ],
            [
                'code' => '7414',
                'name' => 'распылением пневмоэлектростатическим',
                'operation_code' => '7410'
            ],
            [
                'code' => '7415',
                'name' => 'распылением безвоздушным электростатическим',
                'operation_code' => '7410'
            ],
            [
                'code' => '7416',
                'name' => 'распылением аэрозольным',
                'operation_code' => '7410'
            ],
            [
                'code' => '7417',
                'name' => 'распылением центробежным',
                'operation_code' => '7410'
            ],
            [
                'code' => '7418',
                'name' => 'распылением ультразвуковым',
                'operation_code' => '7410'
            ],
            [
                'code' => '7419',
                'name' => 'окунанием без выдержки в парах растворителя',
                'operation_code' => '7410'
            ],
            [
                'code' => '7421',
                'name' => 'окунанием с выдержкой в парах растворителя',
                'operation_code' => '7410'
            ],
            [
                'code' => '7422',
                'name' => 'электроосаждением катодным',
                'operation_code' => '7410'
            ],
            [
                'code' => '7423',
                'name' => 'электроосаждением анодным',
                'operation_code' => '7410'
            ],
            [
                'code' => '7424',
                'name' => 'наливом, обливом',
                'operation_code' => '7410'
            ],
            [
                'code' => '7425',
                'name' => 'валками',
                'operation_code' => '7410'
            ],
            [
                'code' => '7426',
                'name' => 'в барабанах центрифугах',
                'operation_code' => '7410'
            ],
            [
                'code' => '7427',
                'name' => 'кистью, валиком, тампоном и др.',
                'operation_code' => '7410'
            ],
            [
                'code' => '7428',
                'name' => 'автоосаждением',
                'operation_code' => '7410'
            ],
            [
                'code' => '7429',
                'name' => 'струйным обливом без выдержки в парах растворителя',
                'operation_code' => '7410'
            ],
            [
                'code' => '7431',
                'name' => 'струйным обливом с выдержкой в парах растворителя',
                'operation_code' => '7410'
            ],
            [
                'code' => '7432',
                'name' => 'в псевдоожиженном слое',
                'operation_code' => '7410'
            ],
            [
                'code' => '7433',
                'name' => 'Разравнивание',
                'operation_code' => '74'
            ],
            [
                'code' => '7439',
                'name' => 'Загрубление',
                'operation_code' => '74'
            ],
            [
                'code' => '7440',
                'name' => 'Напыление',
                'operation_code' => '74'
            ],
            [
                'code' => '7441',
                'name' => 'в псевдоожиженном слое',
                'operation_code' => '7440'
            ],
            [
                'code' => '7442',
                'name' => 'электростатическое',
                'operation_code' => '7440'
            ],
            [
                'code' => '7443',
                'name' => 'струйное',
                'operation_code' => '7440'
            ],
            [
                'code' => '7444',
                'name' => 'газопламенное',
                'operation_code' => '7440'
            ],
            [
                'code' => '7445',
                'name' => 'плазменное',
                'operation_code' => '7440'
            ],
            [
                'code' => '7446',
                'name' => 'вакуумное',
                'operation_code' => '7440'
            ],
            [
                'code' => '7447',
                'name' => 'Насыпание',
                'operation_code' => '74'
            ],
            [
                'code' => '7450',
                'name' => 'Нанесение рисунка и надписей (в том числе имитация текстуры древесины, кожи, камня, ткани)',
                'operation_code' => '74'
            ],
            [
                'code' => '7451',
                'name' => 'декалькоманией',
                'operation_code' => '7450'
            ],
            [
                'code' => '7452',
                'name' => 'синтетическими материалами',
                'operation_code' => '7450'
            ],
            [
                'code' => '7453',
                'name' => 'печатанием',
                'operation_code' => '7450'
            ],
            [
                'code' => '7454',
                'name' => 'аэрографией',
                'operation_code' => '7450'
            ],
            [
                'code' => '7456',
                'name' => 'шелкографией',
                'operation_code' => '7450'
            ],
            [
                'code' => '7457',
                'name' => 'по трафарету',
                'operation_code' => '7450'
            ],
            [
                'code' => '7458',
                'name' => 'Облицовывание',
                'operation_code' => '74'
            ],
            [
                'code' => '75',
                'name' => 'Электрофизическая, электрохимическая и радиационная обработка',
                'operation_code' => null
            ],
            [
                'code' => '7500',
                'name' => 'Электрофизическая, электрохимическая и радиационная обработка',
                'operation_code' => '75'
            ],
            [
                'code' => '7501',
                'name' => 'Копировально-прошивочная электрофизическая электроэрозионная',
                'operation_code' => '75'
            ],
            [
                'code' => '7502',
                'name' => 'Копировально-прошивочная электромеханическая электромеханическая ультразвуковая',
                'operation_code' => '75'
            ],
            [
                'code' => '7503',
                'name' => 'Копировально-прошивочная электрохимическая',
                'operation_code' => '75'
            ],
            [
                'code' => '7504',
                'name' => 'Копировально-прошивочная комбинированная электроэрозионно-химическая',
                'operation_code' => '75'
            ],
            [
                'code' => '7505',
                'name' => 'Прошивочная электрофизическая лучевая лазерная',
                'operation_code' => '75'
            ],
            [
                'code' => '7506',
                'name' => 'Прошивочная электрофизическая лучевая электроннолучевая',
                'operation_code' => '75'
            ],
            [
                'code' => '7507',
                'name' => 'Прошивочная электрофизическая электромеханическая ультразвуковая',
                'operation_code' => '75'
            ],
            [
                'code' => '7509',
                'name' => 'Профильно-вырезная электрофизическая электроэрозионная электроискровая проволочным электродом',
                'operation_code' => '75'
            ],
            [
                'code' => '7511',
                'name' => 'Профильно-вырезная электрофизическая электроэрозионная электроискровая дисковым электродом',
                'operation_code' => '75'
            ],
            [
                'code' => '7512',
                'name' => 'Профильно-вырезная лучевая лазерная',
                'operation_code' => '75'
            ],
            [
                'code' => '7513',
                'name' => 'Профильно-вырезная лучевая электроннолучевая',
                'operation_code' => '75'
            ],
            [
                'code' => '7514',
                'name' => 'Профильно-вырезная электромеханическая ультразвуковая',
                'operation_code' => '75'
            ],
            [
                'code' => '7515',
                'name' => 'Профильно-вырезная электрохимическая',
                'operation_code' => '75'
            ],
            [
                'code' => '7516',
                'name' => 'Профильно-вырезная комбинированная электроэрозионно-химическая',
                'operation_code' => '75'
            ],
            [
                'code' => '7519',
                'name' => 'Отрезная электрофизическая электроэрозионная электроискровая проволочным электродом',
                'operation_code' => '75'
            ],
            [
                'code' => '7521',
                'name' => 'Отрезная электрофизическая электроэрозионная электроискровая дисковым электродом',
                'operation_code' => '75'
            ],
            [
                'code' => '7523',
                'name' => 'Отрезная электрофизическая лучевая лазерная',
                'operation_code' => '75'
            ],
            [
                'code' => '7524',
                'name' => 'Отрезная электрофизическая электромеханическая ультразвуковая',
                'operation_code' => '75'
            ],
            [
                'code' => '7525',
                'name' => 'Отрезная плазменная',
                'operation_code' => '75'
            ],
            [
                'code' => '7526',
                'name' => 'Отрезная электрохимическая размерная анодно-механическая дисковым электродом',
                'operation_code' => '75'
            ],
            [
                'code' => '7527',
                'name' => 'Отрезная электрохимическая размерная анодно-механическая дисковым электродом',
                'operation_code' => '75'
            ],
            [
                'code' => '7529',
                'name' => 'Заточная электрохимическая размерная анодно-механическая абразивная',
                'operation_code' => '75'
            ],
            [
                'code' => '7531',
                'name' => 'Заточная электрохимическая размерная анодно-механическая алмазная',
                'operation_code' => '75'
            ],
            [
                'code' => '7535',
                'name' => 'Расточная электрофизическая электроэрозионная',
                'operation_code' => '75'
            ],
            [
                'code' => '7536',
                'name' => 'Расточная электромеханическая ультразвуковая',
                'operation_code' => '75'
            ],
            [
                'code' => '7541',
                'name' => 'Плоскошлифовальная электрофизическая электроэрозионная',
                'operation_code' => '75'
            ],
            [
                'code' => '7542',
                'name' => 'Плоскошлифовальная электрохимическая размерная анодно-механическая абразивная',
                'operation_code' => '75'
            ],
            [
                'code' => '7543',
                'name' => 'Плоскошлифовальная электрохимическая размерная анодно-механическая алмазная',
                'operation_code' => '75'
            ],
            [
                'code' => '7545',
                'name' => 'Круглошлифовальная электрохимическая размерная анодно-механическая абразивная',
                'operation_code' => '75'
            ],
            [
                'code' => '7546',
                'name' => 'Круглошлифовальная электрохимическая размерная анодно-механическая алмазная',
                'operation_code' => '75'
            ],
            [
                'code' => '7548',
                'name' => 'Круглошлифовальная электрофизическая электроэрозионная',
                'operation_code' => '75'
            ],
            [
                'code' => '7555',
                'name' => 'Гравировальная электрохимическая',
                'operation_code' => '75'
            ],
            [
                'code' => '7556',
                'name' => 'Гравировальная электрофизическая электроэрозионная',
                'operation_code' => '75'
            ],
            [
                'code' => '7557',
                'name' => 'Гравировальная электрофизическая электромеханическая ультразвуковая',
                'operation_code' => '75'
            ],
            [
                'code' => '7558',
                'name' => 'Гравировальная комбинированная электрофотохимическая',
                'operation_code' => '75'
            ],
            [
                'code' => '7561',
                'name' => 'Отделочно-зачистная электрохимическая',
                'operation_code' => '75'
            ],
            [
                'code' => '7562',
                'name' => 'Отделочно-зачистная электрофизическая электромеханическая ультразвуковая',
                'operation_code' => '75'
            ],
            [
                'code' => '7565',
                'name' => 'Доводочная электрохимическая',
                'operation_code' => '75'
            ],
            [
                'code' => '7566',
                'name' => 'Доводочная электрофизическая электромеханическая ультразвуковая',
                'operation_code' => '75'
            ],
            [
                'code' => '7571',
                'name' => 'Упрочняюще-легирующая электрофизическая электроэрозионная',
                'operation_code' => '75'
            ],
            [
                'code' => '7572',
                'name' => 'Упрочняюще-легирующая электрофизическая лучевая лазерная',
                'operation_code' => '75'
            ],
            [
                'code' => '7573',
                'name' => 'Упрочняюще-легирующая электрофизическая лучевая электроннолучевая',
                'operation_code' => '75'
            ],
            [
                'code' => '7576',
                'name' => 'Резьбонарезная электрофизическая электроэрозионная',
                'operation_code' => '75'
            ],
            [
                'code' => '7577',
                'name' => 'Резьбонарезная электрофизическая электромеханическая ультразвуковая',
                'operation_code' => '75'
            ],
            [
                'code' => '7578',
                'name' => 'Обработка ионизирующим излучением',
                'operation_code' => '75'
            ],
            [
                'code' => '7579',
                'name' => 'Обработка терморадиационная',
                'operation_code' => '75'
            ],
            [
                'code' => '7581',
                'name' => 'Обработка радиационная',
                'operation_code' => '75'
            ],
            [
                'code' => '80',
                'name' => 'Пайка',
                'operation_code' => null
            ],
            [
                'code' => '8000',
                'name' => 'Пайка',
                'operation_code' => '80'
            ],
            [
                'code' => '8006',
                'name' => 'Ограничение растекания припоя',
                'operation_code' => '80'
            ],
            [
                'code' => '8010',
                'name' => 'Пайка готовым припоем',
                'operation_code' => '80'
            ],
            [
                'code' => '8011',
                'name' => 'флюсовая тепловым контактом (паяльником, нагретым газом, нагревательными матами)',
                'operation_code' => '8010'
            ],
            [
                'code' => '8012',
                'name' => 'флюсовая газопламенная',
                'operation_code' => '8010'
            ],
            [
                'code' => '8013',
                'name' => 'флюсовая индукционная',
                'operation_code' => '8010'
            ],
            [
                'code' => '8014',
                'name' => 'флюсовая в печи',
                'operation_code' => '8010'
            ],
            [
                'code' => '8015',
                'name' => 'флюсовая электросопротивлением',
                'operation_code' => '8010'
            ],
            [
                'code' => '8016',
                'name' => 'флюсовая дуговая',
                'operation_code' => '8010'
            ],
            [
                'code' => '8017',
                'name' => 'флюсовая экзотермическая',
                'operation_code' => '8010'
            ],
            [
                'code' => '8018',
                'name' => 'флюсовая волной припоя',
                'operation_code' => '8010'
            ],
            [
                'code' => '8019',
                'name' => 'флюсовая погружением в расплавленный припой',
                'operation_code' => '8010'
            ],
            [
                'code' => '8021',
                'name' => 'флюсовая в расплавленную соль',
                'operation_code' => '8010'
            ],
            [
                'code' => '8022',
                'name' => 'флюсовая плазменная',
                'operation_code' => '8010'
            ],
            [
                'code' => '8035',
                'name' => 'в нейтральной газовой среде в печи',
                'operation_code' => '8010'
            ],
            [
                'code' => '8036',
                'name' => 'в нейтральной газовой среде индукционная',
                'operation_code' => '8010'
            ],
            [
                'code' => '8037',
                'name' => 'в нейтральной газовой среде радиационная (световыми лучами, инфракрасными лучами, лазерная)',
                'operation_code' => '8010'
            ],
            [
                'code' => '8038',
                'name' => 'в активной газовой среде в печи',
                'operation_code' => '8010'
            ],
            [
                'code' => '8039',
                'name' => 'в активной газовой среде индукционная',
                'operation_code' => '8010'
            ],
            [
                'code' => '8041',
                'name' => 'в активной газовой среде радиационная (световыми лучами, инфракрасными лучами, лазерная)',
                'operation_code' => '8010'
            ],
            [
                'code' => '8042',
                'name' => 'в вакууме в печи',
                'operation_code' => '8010'
            ],
            [
                'code' => '8043',
                'name' => 'в вакууме индукционная',
                'operation_code' => '8010'
            ],
            [
                'code' => '8044',
                'name' => 'в вакууме радиационная (световыми лучами, инфракрасными лучами, лазерная)',
                'operation_code' => '8010'
            ],
            [
                'code' => '8045',
                'name' => 'в вакууме электроннолучевая',
                'operation_code' => '8010'
            ],
            [
                'code' => '8046',
                'name' => 'в вакууме тлеющим разрядом',
                'operation_code' => '8010'
            ],
            [
                'code' => '8050',
                'name' => 'Контактно-реактивная пайка',
                'operation_code' => '80'
            ],
            [
                'code' => '8051',
                'name' => 'в нейтральной газовой среде в печи',
                'operation_code' => '8050'
            ],
            [
                'code' => '8052',
                'name' => 'в нейтральной газовой среде индукционная',
                'operation_code' => '8050'
            ],
            [
                'code' => '8053',
                'name' => 'в нейтральной газовой среде радиационная (световыми лучами, инфракрасными лучами, лазерная)',
                'operation_code' => '8050'
            ],
            [
                'code' => '8054',
                'name' => 'в активной газовой среде в печи',
                'operation_code' => '8050'
            ],
            [
                'code' => '8055',
                'name' => 'в активной газовой среде индукционная',
                'operation_code' => '8050'
            ],
            [
                'code' => '8056',
                'name' => 'в активной газовой среде радиационная (световыми лучами, инфракрасными лучами, лазерная)',
                'operation_code' => '8050'
            ],
            [
                'code' => '8057',
                'name' => 'в вакууме в печи',
                'operation_code' => '8050'
            ],
            [
                'code' => '8058',
                'name' => 'в вакууме индукционная',
                'operation_code' => '8050'
            ],
            [
                'code' => '8059',
                'name' => 'в вакууме радиационная (световыми лучами, инфракрасными лучами, лазерная)',
                'operation_code' => '8050'
            ],
            [
                'code' => '8061',
                'name' => 'в вакууме электроннолучевая',
                'operation_code' => '8050'
            ],
            [
                'code' => '8062',
                'name' => 'в вакууме тлеющим разрядом',
                'operation_code' => '8050'
            ],
            [
                'code' => '8070',
                'name' => 'Реактивно-флюсовая пайка',
                'operation_code' => '80'
            ],
            [
                'code' => '8071',
                'name' => 'в печи',
                'operation_code' => '8070'
            ],
            [
                'code' => '8072',
                'name' => 'газопламенная',
                'operation_code' => '8070'
            ],
            [
                'code' => '8073',
                'name' => 'погружением в расплавленный флюс',
                'operation_code' => '8070'
            ],
            [
                'code' => '8074',
                'name' => 'экзотермическая',
                'operation_code' => '8070'
            ],
            [
                'code' => '8077',
                'name' => 'Электролитная пайка',
                'operation_code' => '80'
            ],
            [
                'code' => '81',
                'name' => 'Пайка',
                'operation_code' => null
            ],
            [
                'code' => '8110',
                'name' => 'Пайкосварка',
                'operation_code' => '81'
            ],
            [
                'code' => '8111',
                'name' => 'флюсовая газопламенная',
                'operation_code' => '8110'
            ],
            [
                'code' => '8112',
                'name' => 'флюсовая дуговая',
                'operation_code' => '8110'
            ],
            [
                'code' => '8120',
                'name' => 'Сваркопайка',
                'operation_code' => '81'
            ],
            [
                'code' => '8121',
                'name' => 'флюсовая газопламенная',
                'operation_code' => '8120'
            ],
            [
                'code' => '8122',
                'name' => 'флюсовая дуговая',
                'operation_code' => '8120'
            ],
            [
                'code' => '8123',
                'name' => 'в нейтральной газовой среде дуговая',
                'operation_code' => '8120'
            ],
            [
                'code' => '8130',
                'name' => 'Комбинированная пайка',
                'operation_code' => '81'
            ],
            [
                'code' => '8131',
                'name' => 'диффузионная контактно-реактивная в печи в газовой среде в нейтральной',
                'operation_code' => '8130'
            ],
            [
                'code' => '8132',
                'name' => 'диффузионная контактно-реактивная в печи в газовой среде в активной',
                'operation_code' => '8130'
            ],
            [
                'code' => '8133',
                'name' => 'диффузионная контактно-реактивная в печи в вакууме',
                'operation_code' => '8130'
            ],
            [
                'code' => '8134',
                'name' => 'диффузионная готовым припоем в печи в газовой среде в нейтральной',
                'operation_code' => '8130'
            ],
            [
                'code' => '8135',
                'name' => 'диффузионная готовым припоем в печи в газовой среде в активной',
                'operation_code' => '8130'
            ],
            [
                'code' => '8136',
                'name' => 'диффузионная готовым припоем в печи в вакууме',
                'operation_code' => '8130'
            ],
            [
                'code' => '8141',
                'name' => 'диффузионная контактно-реактивная электронно-лучевая в вакууме',
                'operation_code' => '8130'
            ],
            [
                'code' => '8142',
                'name' => 'диффузионная готовым припоем электронно-лучевая в вакууме',
                'operation_code' => '8130'
            ],
            [
                'code' => '8160',
                'name' => 'Лужение',
                'operation_code' => '81'
            ],
            [
                'code' => '8161',
                'name' => 'абразивное паяльником',
                'operation_code' => '8160'
            ],
            [
                'code' => '8162',
                'name' => 'абразивное газопламенное',
                'operation_code' => '8160'
            ],
            [
                'code' => '8163',
                'name' => 'абразивно-кристаллическое паяльником',
                'operation_code' => '8160'
            ],
            [
                'code' => '8164',
                'name' => 'абразивно-кристаллическое газопламенное',
                'operation_code' => '8160'
            ],
            [
                'code' => '8165',
                'name' => 'абразивно-кавитационное погружением в расплавленный припой',
                'operation_code' => '8160'
            ],
            [
                'code' => '8167',
                'name' => 'ультразвуковое паяльником',
                'operation_code' => '8160'
            ],
            [
                'code' => '8168',
                'name' => 'ультразвуковое погружением в расплавленный припой',
                'operation_code' => '8160'
            ],
            [
                'code' => '8171',
                'name' => 'флюсовое паяльником',
                'operation_code' => '8160'
            ],
            [
                'code' => '8172',
                'name' => 'флюсовое газопламенное',
                'operation_code' => '8160'
            ],
            [
                'code' => '8173',
                'name' => 'флюсовое в печи',
                'operation_code' => '8160'
            ],
            [
                'code' => '8174',
                'name' => 'флюсовое погружением в расплавленный припой',
                'operation_code' => '8160'
            ],
            [
                'code' => '85',
                'name' => 'Электромонтаж',
                'operation_code' => null
            ],
            [
                'code' => '8500',
                'name' => 'Электромонтаж',
                'operation_code' => '85'
            ],
            [
                'code' => '8501',
                'name' => 'Регулировка, настройка, юстировка',
                'operation_code' => '85'
            ],
            [
                'code' => '8502',
                'name' => 'Бахромирование',
                'operation_code' => '85'
            ],
            [
                'code' => '8504',
                'name' => 'Разделка провода, кабеля, жилы',
                'operation_code' => '85'
            ],
            [
                'code' => '8505',
                'name' => 'Раскладка провода, кабеля',
                'operation_code' => '85'
            ],
            [
                'code' => '8508',
                'name' => 'Бандажирование',
                'operation_code' => '85'
            ],
            [
                'code' => '8509',
                'name' => 'Плетение',
                'operation_code' => '85'
            ],
            [
                'code' => '8511',
                'name' => 'Свивание, скручивание',
                'operation_code' => '85'
            ],
            [
                'code' => '8512',
                'name' => 'Мерная резка',
                'operation_code' => '85'
            ],
            [
                'code' => '8521',
                'name' => 'Протягивание провода, кабеля, жгута',
                'operation_code' => '85'
            ],
            [
                'code' => '8522',
                'name' => 'Размотка провода, кабеля',
                'operation_code' => '85'
            ],
            [
                'code' => '8531',
                'name' => 'Формовка выводов электрорадиоэлементов',
                'operation_code' => '85'
            ],
            [
                'code' => '8535',
                'name' => 'Намотка, перемотка',
                'operation_code' => '85'
            ],
            [
                'code' => '8536',
                'name' => 'каркасная',
                'operation_code' => '8535'
            ],
            [
                'code' => '8537',
                'name' => 'бескаркасная',
                'operation_code' => '8535'
            ],
            [
                'code' => '8551',
                'name' => 'Вощение шпагата',
                'operation_code' => '85'
            ],
            [
                'code' => '8552',
                'name' => 'Экранирование',
                'operation_code' => '85'
            ],
            [
                'code' => '88',
                'name' => 'Сборка',
                'operation_code' => null
            ],
            [
                'code' => '8800',
                'name' => 'Сборка',
                'operation_code' => '88'
            ],
            [
                'code' => '8801',
                'name' => 'Базирование',
                'operation_code' => '88'
            ],
            [
                'code' => '8803',
                'name' => 'Балансировка',
                'operation_code' => '88'
            ],
            [
                'code' => '8821',
                'name' => 'Стопорение',
                'operation_code' => '88'
            ],
            [
                'code' => '8822',
                'name' => 'Штифтование',
                'operation_code' => '88'
            ],
            [
                'code' => '8823',
                'name' => 'Запрессовывание',
                'operation_code' => '88'
            ],
            [
                'code' => '8824',
                'name' => 'Контровка',
                'operation_code' => '88'
            ],
            [
                'code' => '8831',
                'name' => 'Свинчивание',
                'operation_code' => '88'
            ],
            [
                'code' => '8832',
                'name' => 'Застегивание',
                'operation_code' => '88'
            ],
            [
                'code' => '8841',
                'name' => 'Клепка',
                'operation_code' => '88'
            ],
            [
                'code' => '8842',
                'name' => 'Развальцовка',
                'operation_code' => '88'
            ],
            [
                'code' => '8843',
                'name' => 'Фальцевание',
                'operation_code' => '88'
            ],
            [
                'code' => '8844',
                'name' => 'Накручивание',
                'operation_code' => '88'
            ],
            [
                'code' => '8846',
                'name' => 'Склеивание',
                'operation_code' => '88'
            ],
            [
                'code' => '8847',
                'name' => 'Сшивание',
                'operation_code' => '88'
            ],
            [
                'code' => '8848',
                'name' => 'Сколачивание',
                'operation_code' => '88'
            ],
            [
                'code' => '8849',
                'name' => 'Центрирование',
                'operation_code' => '88'
            ],
            [
                'code' => '8851',
                'name' => 'Шплинтование',
                'operation_code' => '88'
            ],
            [
                'code' => '8852',
                'name' => 'Распрессовывание',
                'operation_code' => '88'
            ],
            [
                'code' => '8853',
                'name' => 'Расштифтовывание',
                'operation_code' => '88'
            ],
            [
                'code' => '8854',
                'name' => 'Расшплинтовывание',
                'operation_code' => '88'
            ],
            [
                'code' => '8856',
                'name' => 'Рязвинчивание',
                'operation_code' => '88'
            ],
            [
                'code' => '8857',
                'name' => 'Расстегивание',
                'operation_code' => '88'
            ],
            [
                'code' => '8858',
                'name' => 'Монтаж',
                'operation_code' => '88'
            ],
            [
                'code' => '8859',
                'name' => 'Демонтаж',
                'operation_code' => '88'
            ],
            [
                'code' => '8861',
                'name' => 'Разборка',
                'operation_code' => '88'
            ],
            [
                'code' => '8862',
                'name' => 'Сборочно-подготовительная',
                'operation_code' => '88'
            ],
            [
                'code' => '8863',
                'name' => 'Сборочно-монтажная',
                'operation_code' => '88'
            ],
            [
                'code' => '8864',
                'name' => 'Слесарно-сборочная',
                'operation_code' => '88'
            ],
            [
                'code' => '8866',
                'name' => 'Приклеивание',
                'operation_code' => '88'
            ],
            [
                'code' => '8867',
                'name' => 'Отклеивание',
                'operation_code' => '88'
            ],
            [
                'code' => '8870',
                'name' => 'Сборка и монтаж изделий электронной техники (ИЭТ)',
                'operation_code' => '88'
            ],
            [
                'code' => '8871',
                'name' => 'Сборка корпуса',
                'operation_code' => '8870'
            ],
            [
                'code' => '8872',
                'name' => 'Сборка блока арматуры',
                'operation_code' => '8870'
            ],
            [
                'code' => '8873',
                'name' => 'Монтаж ножки собранной',
                'operation_code' => '8870'
            ],
            [
                'code' => '8874',
                'name' => 'Монтаж блока арматуры на ножку',
                'operation_code' => '8870'
            ],
            [
                'code' => '8876',
                'name' => 'Монтаж блока арматуры (кристалла) на ножку',
                'operation_code' => '8870'
            ],
            [
                'code' => '8877',
                'name' => 'Монтаж  кристалла в корпус',
                'operation_code' => '8870'
            ],
            [
                'code' => '8878',
                'name' => 'Монтаж комплектующих изделий',
                'operation_code' => '8870'
            ],
            [
                'code' => '8879',
                'name' => 'Загрузка кассет комплектующими изделиями',
                'operation_code' => '8870'
            ],
            [
                'code' => '8881',
                'name' => 'Присоединение выводов',
                'operation_code' => '8870'
            ],
            [
                'code' => '8882',
                'name' => 'Распайка и «тару-спутник»',
                'operation_code' => '8870'
            ],
            [
                'code' => '90',
                'name' => 'Сварка',
                'operation_code' => null
            ],
            [
                'code' => '9000',
                'name' => 'Сварка',
                'operation_code' => '90'
            ],
            [
                'code' => '9001',
                'name' => 'Индукционно-прессовая сварка',
                'operation_code' => '90'
            ],
            [
                'code' => '9002',
                'name' => 'Газопрессовая сварка',
                'operation_code' => '90'
            ],
            [
                'code' => '9003',
                'name' => 'Термокомпрессионная сварка',
                'operation_code' => '90'
            ],
            [
                'code' => '9004',
                'name' => 'Дугопрессовая сварка',
                'operation_code' => '90'
            ],
            [
                'code' => '9005',
                'name' => 'Шлакопрессовая сварка',
                'operation_code' => '90'
            ],
            [
                'code' => '9006',
                'name' => 'Термитно-прессовая сварка',
                'operation_code' => '90'
            ],
            [
                'code' => '9007',
                'name' => 'Печная сварка',
                'operation_code' => '90'
            ],
            [
                'code' => '9010',
                'name' => 'Контактная сварка',
                'operation_code' => '90'
            ],
            [
                'code' => '9011',
                'name' => 'точечная',
                'operation_code' => '9010'
            ],
            [
                'code' => '9012',
                'name' => 'шовная',
                'operation_code' => '9010'
            ],
            [
                'code' => '9013',
                'name' => 'стыковая',
                'operation_code' => '9010'
            ],
            [
                'code' => '9014',
                'name' => 'рельефная',
                'operation_code' => '9010'
            ],
            [
                'code' => '9015',
                'name' => 'шовно-стыковая',
                'operation_code' => '9010'
            ],
            [
                'code' => '9020',
                'name' => 'Диффузионная сварка',
                'operation_code' => '90'
            ],
            [
                'code' => '9021',
                'name' => 'в инертных газах',
                'operation_code' => '9020'
            ],
            [
                'code' => '9022',
                'name' => 'в активных газах',
                'operation_code' => '9020'
            ],
            [
                'code' => '9023',
                'name' => 'в вакууме',
                'operation_code' => '9020'
            ],
            [
                'code' => '9025',
                'name' => 'Световая сварка',
                'operation_code' => '90'
            ],
            [
                'code' => '9026',
                'name' => 'лазерная',
                'operation_code' => '9025'
            ],
            [
                'code' => '9027',
                'name' => 'энергией лучей оптического диапазона',
                'operation_code' => '9025'
            ],
            [
                'code' => '9028',
                'name' => 'инфракрасным излучением',
                'operation_code' => '9025'
            ],
            [
                'code' => '9030',
                'name' => 'Дуговая сварка',
                'operation_code' => '90'
            ],
            [
                'code' => '9031',
                'name' => 'покрытым электродом',
                'operation_code' => '9030'
            ],
            [
                'code' => '9032',
                'name' => 'пучком покрытых электродов',
                'operation_code' => '9030'
            ],
            [
                'code' => '9033',
                'name' => 'самозащитной проволокой',
                'operation_code' => '9030'
            ],
            [
                'code' => '9034',
                'name' => 'порошковой проволокой',
                'operation_code' => '9030'
            ],
            [
                'code' => '9035',
                'name' => 'под флюсом',
                'operation_code' => '9030'
            ],
            [
                'code' => '9036',
                'name' => 'плавящимся электродом',
                'operation_code' => '9035'
            ],
            [
                'code' => '9037',
                'name' => 'неплавящимся электродом с присадочным металлом',
                'operation_code' => '9035'
            ],
            [
                'code' => '9038',
                'name' => 'неплавящимся электродом без присадочного металла',
                'operation_code' => '9035'
            ],
            [
                'code' => '9039',
                'name' => 'в инертных газах плавящимся электродом',
                'operation_code' => '9030'
            ],
            [
                'code' => '9041',
                'name' => 'в инертных газах плавящимся электродом с присадочным металлом',
                'operation_code' => '9030'
            ],
            [
                'code' => '9042',
                'name' => 'в инертных газах плавящимся электродом без присадочного металла',
                'operation_code' => '9030'
            ],
            [
                'code' => '9043',
                'name' => 'в углекислом газе сплошной проволокой',
                'operation_code' => '9030'
            ],
            [
                'code' => '9044',
                'name' => 'в углекислом газе порошковой проволокой',
                'operation_code' => '9030'
            ],
            [
                'code' => '9045',
                'name' => 'в углекислом газе неплавящимся электродом с присадочным металлом',
                'operation_code' => '9030'
            ],
            [
                'code' => '9046',
                'name' => 'в углекислом газе неплавящимся электродом без присадочного металла',
                'operation_code' => '9030'
            ],
            [
                'code' => '9047',
                'name' => 'в азоте плавящимся электродом',
                'operation_code' => '9030'
            ],
            [
                'code' => '9048',
                'name' => 'в азоте неплавящимся электродом с присадочным металлом',
                'operation_code' => '9030'
            ],
            [
                'code' => '9049',
                'name' => 'в азоте неплавящимся электродом без присадочного металла',
                'operation_code' => '9030'
            ],
            [
                'code' => '9051',
                'name' => 'в смеси инертных и активных газов плавящимся электродом',
                'operation_code' => '9030'
            ],
            [
                'code' => '9052',
                'name' => 'в концентрических потоках инертного и активного газов плавящимся электродом',
                'operation_code' => '9030'
            ],
            [
                'code' => '9053',
                'name' => 'в концентрических потоках инертного и активного газов неплавящимся электродом с присадочным металлом',
                'operation_code' => '9030'
            ],
            [
                'code' => '9054',
                'name' => 'в концентрических потоках инертного и активного газов неплавящимся электродом без присадочного металла',
                'operation_code' => '9030'
            ],
            [
                'code' => '9055',
                'name' => 'в водяном паре',
                'operation_code' => '9030'
            ],
            [
                'code' => '9056',
                'name' => 'в вакууме плавящимся электродом',
                'operation_code' => '9030'
            ],
            [
                'code' => '9057',
                'name' => 'в вакууме неплавящимся электродом с присадочным металлом',
                'operation_code' => '9030'
            ],
            [
                'code' => '9058',
                'name' => 'в вакууме неплавящимся электродом без присадочного металла',
                'operation_code' => '9030'
            ],
            [
                'code' => '9061',
                'name' => 'Электрошлаковая сварка',
                'operation_code' => '90'
            ],
            [
                'code' => '9062',
                'name' => 'Электронно-лучевая сварка',
                'operation_code' => '90'
            ],
            [
                'code' => '9063',
                'name' => 'Плазменная сварка',
                'operation_code' => '90'
            ],
            [
                'code' => '9064',
                'name' => 'Ионно-лучевая сварка',
                'operation_code' => '90'
            ],
            [
                'code' => '9065',
                'name' => 'Сварка тлеющим разрядом',
                'operation_code' => '90'
            ],
            [
                'code' => '9066',
                'name' => 'Термоимпульсная сварка',
                'operation_code' => '90'
            ],
            [
                'code' => '9067',
                'name' => 'Индукционная сварка',
                'operation_code' => '90'
            ],
            [
                'code' => '9068',
                'name' => 'Газовая сварка',
                'operation_code' => '90'
            ],
            [
                'code' => '9069',
                'name' => 'Термитная сварка',
                'operation_code' => '90'
            ],
            [
                'code' => '9071',
                'name' => 'Литейная сварка',
                'operation_code' => '90'
            ],
            [
                'code' => '9072',
                'name' => 'Сварка взрывом',
                'operation_code' => '90'
            ],
            [
                'code' => '9073',
                'name' => 'Сварка трением',
                'operation_code' => '90'
            ],
            [
                'code' => '9074',
                'name' => 'Магнито-импульсная сварка',
                'operation_code' => '90'
            ],
            [
                'code' => '9075',
                'name' => 'Сварка газовым теплоносителем',
                'operation_code' => '90'
            ],
            [
                'code' => '9076',
                'name' => 'Сварка экструдированной присадкой',
                'operation_code' => '90'
            ],
            [
                'code' => '9080',
                'name' => 'Ультразвуковая сварка',
                'operation_code' => '90'
            ],
            [
                'code' => '9081',
                'name' => 'точечная',
                'operation_code' => '9080'
            ],
            [
                'code' => '9082',
                'name' => 'шовная',
                'operation_code' => '9080'
            ],
            [
                'code' => '9083',
                'name' => 'стыковая',
                'operation_code' => '9080'
            ],
            [
                'code' => '9090',
                'name' => 'Холодная сварка',
                'operation_code' => '90'
            ],
            [
                'code' => '9091',
                'name' => 'точечная',
                'operation_code' => '9090'
            ],
            [
                'code' => '9092',
                'name' => 'шовная',
                'operation_code' => '9090'
            ],
            [
                'code' => '9093',
                'name' => 'стыковая',
                'operation_code' => '9090'
            ],
            [
                'code' => '91',
                'name' => 'Сварка',
                'operation_code' => null
            ],
            [
                'code' => '9110',
                'name' => 'Наплавка',
                'operation_code' => '91'
            ],
            [
                'code' => '9111',
                'name' => 'дуговая покрытым электродом',
                'operation_code' => '9110'
            ],
            [
                'code' => '9112',
                'name' => 'дуговая пучком покрытых электродов',
                'operation_code' => '9110'
            ],
            [
                'code' => '9113',
                'name' => 'дуговая самозащитной проволокой',
                'operation_code' => '9110'
            ],
            [
                'code' => '9114',
                'name' => 'дуговая порошковой проволокой',
                'operation_code' => '9110'
            ],
            [
                'code' => '9115',
                'name' => 'дуговая под флюсом',
                'operation_code' => '9110'
            ],
            [
                'code' => '9116',
                'name' => 'дуговая по флюсу',
                'operation_code' => '9110'
            ],
            [
                'code' => '9117',
                'name' => 'дуговая в инертных газах плавящимся электродом',
                'operation_code' => '9110'
            ],
            [
                'code' => '9118',
                'name' => 'дуговая в инертных газах неплавящимся электродом',
                'operation_code' => '9110'
            ],
            [
                'code' => '9119',
                'name' => 'дуговая в инертных газах сплошной проволокой',
                'operation_code' => '9110'
            ],
            [
                'code' => '9121',
                'name' => 'дуговая в углекислом газе порошковой проволокой',
                'operation_code' => '9110'
            ],
            [
                'code' => '9122',
                'name' => 'дуговая в углекислом газе неплавящимся электродом',
                'operation_code' => '9110'
            ],
            [
                'code' => '9123',
                'name' => 'дуговая в азоте плавящимся электродом',
                'operation_code' => '9110'
            ],
            [
                'code' => '9124',
                'name' => 'дуговая в азоте неплавящимся электродом',
                'operation_code' => '9110'
            ],
            [
                'code' => '9125',
                'name' => 'вибродуговая',
                'operation_code' => '9110'
            ],
            [
                'code' => '9126',
                'name' => 'индукционная',
                'operation_code' => '9110'
            ],
            [
                'code' => '9127',
                'name' => 'электрошлаковая',
                'operation_code' => '9110'
            ],
            [
                'code' => '9128',
                'name' => 'плазменная',
                'operation_code' => '9110'
            ],
            [
                'code' => '9129',
                'name' => 'трением',
                'operation_code' => '9110'
            ],
            [
                'code' => '9130',
                'name' => 'с помощью контактной сварки',
                'operation_code' => '9110'
            ],
            [
                'code' => '9132',
                'name' => 'газопламенная',
                'operation_code' => '9110'
            ],
            [
                'code' => '9133',
                'name' => 'с использованием жидкого присадочного металла',
                'operation_code' => '9110'
            ],
            [
                'code' => '9170',
                'name' => 'Термическая резка',
                'operation_code' => '91'
            ],
            [
                'code' => '9171',
                'name' => 'лазерная',
                'operation_code' => '9170'
            ],
            [
                'code' => '9172',
                'name' => 'кислородная',
                'operation_code' => '9170'
            ],
            [
                'code' => '9173',
                'name' => 'кислородно-флюсовая',
                'operation_code' => '9170'
            ],
            [
                'code' => '9174',
                'name' => 'дуговая',
                'operation_code' => '9170'
            ],
            [
                'code' => '9175',
                'name' => 'воздушно-дуговая',
                'operation_code' => '9170'
            ],
            [
                'code' => '9176',
                'name' => 'плазменно-дуговая',
                'operation_code' => '9170'
            ],
            [
                'code' => '9177',
                'name' => 'кислородно-лазерная',
                'operation_code' => '9170'
            ],
            [
                'code' => '9180',
                'name' => 'Термоконтактная сварка',
                'operation_code' => '91'
            ],
            [
                'code' => '9181',
                'name' => 'оплавлением',
                'operation_code' => '9180'
            ],
            [
                'code' => '9182',
                'name' => 'проплавлением',
                'operation_code' => '9180'
            ],
            [
                'code' => '9183',
                'name' => 'нагретым инструментом ленточным теплоносителем',
                'operation_code' => '9180'
            ],
            [
                'code' => '9184',
                'name' => 'нагретым инструментом роликом',
                'operation_code' => '9180'
            ],
            [
                'code' => '9185',
                'name' => 'нагретым инструментом полозом',
                'operation_code' => '9180'
            ],
            [
                'code' => '9186',
                'name' => 'внахлестку',
                'operation_code' => '9180'
            ],
            [
                'code' => '9187',
                'name' => 'встык',
                'operation_code' => '9180'
            ]
        ]);
    }
}
