<?php

namespace Database\Seeders\Orders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class CustomerSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('customers')->insert([
            [
                'inn' => '1234567890',
                'name' => 'АВТ_П3_17'
            ],
            [
                'inn' => '1234567891',
                'name' => 'АВТ_П3_18'
            ],
            [
                'inn' => '1234567892',
                'name' => 'Агат_ГО3_22'
            ],
            [
                'inn' => '1234567893',
                'name' => 'Агат_П3_17'
            ],
            [
                'inn' => '1234567894',
                'name' => 'Агат_П3_18'
            ],
            [
                'inn' => '1234567895',
                'name' => 'Агат_П3_19'
            ],
            [
                'inn' => '1234567896',
                'name' => 'АС_ГК_19'
            ],
            [
                'inn' => '1234567897',
                'name' => 'АС_ГК_20'
            ],
            [
                'inn' => '1234567898',
                'name' => 'АС_ГК_22'
            ],
            [
                'inn' => '1234567899',
                'name' => 'Изм_П3_19'
            ],
            [
                'inn' => '1234567810',
                'name' => 'Изм_П3_20'
            ],
            [
                'inn' => '1234567811',
                'name' => 'Имп_П3_19'
            ],
            [
                'inn' => '1234567812',
                'name' => 'Имп_П3_20'
            ],
            [
                'inn' => '1234567813',
                'name' => 'ИРС_ГО3_20'
            ],
            [
                'inn' => '1234567814',
                'name' => 'Нав_ГО3_17'
            ],
            [
                'inn' => '1234567815',
                'name' => 'Нав_ГО3_18'
            ],
            [
                'inn' => '1234567816',
                'name' => 'Нав_ГО3_19'
            ],
            [
                'inn' => '1234567817',
                'name' => 'Нав_ГО3_20'
            ],
            [
                'inn' => '1234567818',
                'name' => 'Нав_ГО3_21'
            ],
            [
                'inn' => '1234567819',
                'name' => 'Нав_ГО3_22'
            ],
            [
                'inn' => '1234567820',
                'name' => 'Нав_ГО3_23'
            ]
        ]);
    }
}
